TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_MINDBCFG                                                      (0x00000C00U)
#define PWM_EPWM_MINDBDLY                                                      (0x00000C04U)
#define PWM_EPWM_RESERVED_79(RESERVED_79)                                      (0x00000C08U+((RESERVED_79)*0x4U))
#define PWM_EPWM_LUTCTLA                                                       (0x00000C20U)
#define PWM_EPWM_LUTCTLB                                                       (0x00000C24U)
#define PWM_EPWM_RESERVED_80(RESERVED_80)                                      (0x00000C28U+((RESERVED_80)*0x4U))

/**************************************************************************
* Field Definition Macros
**************************************************************************/


/* TBCTL */

#define PWM_EPWM_TBCTL_CTRMODE_MASK                                            (0x0003U)
#define PWM_EPWM_TBCTL_CTRMODE_SHIFT                                           (0x0000U)
#define PWM_EPWM_TBCTL_CTRMODE_RESETVAL                                        (0x0003U)
#define PWM_EPWM_TBCTL_CTRMODE_MAX                                             (0x0003U)

#define PWM_EPWM_TBCTL_PHSEN_MASK                                              (0x0004U)
#define PWM_EPWM_TBCTL_PHSEN_SHIFT                                             (0x0002U)
#define PWM_EPWM_TBCTL_PHSEN_RESETVAL                                          (0x0000U)
#define PWM_EPWM_TBCTL_PHSEN_MAX                                               (0x0001U)

#define PWM_EPWM_TBCTL_PRDLD_MASK                                              (0x0008U)
#define PWM_EPWM_TBCTL_PRDLD_SHIFT                                             (0x0003U)
#define PWM_EPWM_TBCTL_PRDLD_RESETVAL                                          (0x0000U)
#define PWM_EPWM_TBCTL_PRDLD_MAX                                               (0x0001U)

#define PWM_EPWM_TBCTL_RESERVED_1_MASK                                         (0x0030U)
#define PWM_EPWM_TBCTL_RESERVED_1_SHIFT                                        (0x0004U)
#define PWM_EPWM_TBCTL_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_TBCTL_RESERVED_1_MAX                                          (0x0003U)

#define PWM_EPWM_TBCTL_SWFSYNC_MASK                                            (0x0040U)
#define PWM_EPWM_TBCTL_SWFSYNC_SHIFT                                           (0x0006U)
#define PWM_EPWM_TBCTL_SWFSYNC_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TBCTL_SWFSYNC_MAX                                             (0x0001U)

#define PWM_EPWM_TBCTL_HSPCLKDIV_MASK                                          (0x0380U)
#define PWM_EPWM_TBCTL_HSPCLKDIV_SHIFT                                         (0x0007U)
#define PWM_EPWM_TBCTL_HSPCLKDIV_RESETVAL                                      (0x0001U)
#define PWM_EPWM_TBCTL_HSPCLKDIV_MAX                                           (0x0007U)

#define PWM_EPWM_TBCTL_CLKDIV_MASK                                             (0x1C00U)
#define PWM_EPWM_TBCTL_CLKDIV_SHIFT                                            (0x000AU)
#define PWM_EPWM_TBCTL_CLKDIV_RESETVAL                                         (0x0000U)
#define PWM_EPWM_TBCTL_CLKDIV_MAX                                              (0x0007U)

#define PWM_EPWM_TBCTL_PHSDIR_MASK                                             (0x2000U)
#define PWM_EPWM_TBCTL_PHSDIR_SHIFT                                            (0x000DU)
#define PWM_EPWM_TBCTL_PHSDIR_RESETVAL                                         (0x0000U)
#define PWM_EPWM_TBCTL_PHSDIR_MAX                                              (0x0001U)

#define PWM_EPWM_TBCTL_FREE_SOFT_MASK                                          (0xC000U)
#define PWM_EPWM_TBCTL_FREE_SOFT_SHIFT                                         (0x000EU)
#define PWM_EPWM_TBCTL_FREE_SOFT_RESETVAL                                      (0x0000U)
#define PWM_EPWM_TBCTL_FREE_SOFT_MAX                                           (0x0003U)

#define PWM_EPWM_TBCTL_RESETVAL                                                (0x0083U)

/* TBCTL2 */

#define PWM_EPWM_TBCTL2_RESERVED_1_MASK                                        (0x001FU)
#define PWM_EPWM_TBCTL2_RESERVED_1_SHIFT                                       (0x0000U)
#define PWM_EPWM_TBCTL2_RESERVED_1_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TBCTL2_RESERVED_1_MAX                                         (0x001FU)

#define PWM_EPWM_TBCTL2_SELFCLRTRREM_MASK                                      (0x0020U)
#define PWM_EPWM_TBCTL2_SELFCLRTRREM_SHIFT                                     (0x0005U)
#define PWM_EPWM_TBCTL2_SELFCLRTRREM_RESETVAL                                  (0x0000U)
#define PWM_EPWM_TBCTL2_SELFCLRTRREM_MAX                                       (0x0001U)

#define PWM_EPWM_TBCTL2_OSHTSYNCMODE_MASK                                      (0x0040U)
#define PWM_EPWM_TBCTL2_OSHTSYNCMODE_SHIFT                                     (0x0006U)
#define PWM_EPWM_TBCTL2_OSHTSYNCMODE_RESETVAL                                  (0x0000U)
#define PWM_EPWM_TBCTL2_OSHTSYNCMODE_MAX                                       (0x0001U)

#define PWM_EPWM_TBCTL2_OSHTSYNC_MASK                                          (0x0080U)
#define PWM_EPWM_TBCTL2_OSHTSYNC_SHIFT                                         (0x0007U)
#define PWM_EPWM_TBCTL2_OSHTSYNC_RESETVAL                                      (0x0000U)
#define PWM_EPWM_TBCTL2_OSHTSYNC_MAX                                           (0x0001U)

#define PWM_EPWM_TBCTL2_RESERVED_2_MASK                                        (0x0F00U)
#define PWM_EPWM_TBCTL2_RESERVED_2_SHIFT                                       (0x0008U)
#define PWM_EPWM_TBCTL2_RESERVED_2_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TBCTL2_RESERVED_2_MAX                                         (0x000FU)

#define PWM_EPWM_TBCTL2_RESERVED_3_MASK                                        (0x3000U)
#define PWM_EPWM_TBCTL2_RESERVED_3_SHIFT                                       (0x000CU)
#define PWM_EPWM_TBCTL2_RESERVED_3_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TBCTL2_RESERVED_3_MAX                                         (0x0003U)

