TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_CMPCTL2_LOADCMODE_MASK                                        (0x0003U)
#define PWM_EPWM_CMPCTL2_LOADCMODE_SHIFT                                       (0x0000U)
#define PWM_EPWM_CMPCTL2_LOADCMODE_RESETVAL                                    (0x0000U)
#define PWM_EPWM_CMPCTL2_LOADCMODE_MAX                                         (0x0003U)

#define PWM_EPWM_CMPCTL2_LOADDMODE_MASK                                        (0x000CU)
#define PWM_EPWM_CMPCTL2_LOADDMODE_SHIFT                                       (0x0002U)
#define PWM_EPWM_CMPCTL2_LOADDMODE_RESETVAL                                    (0x0000U)
#define PWM_EPWM_CMPCTL2_LOADDMODE_MAX                                         (0x0003U)

#define PWM_EPWM_CMPCTL2_SHDWCMODE_MASK                                        (0x0010U)
#define PWM_EPWM_CMPCTL2_SHDWCMODE_SHIFT                                       (0x0004U)
#define PWM_EPWM_CMPCTL2_SHDWCMODE_RESETVAL                                    (0x0000U)
#define PWM_EPWM_CMPCTL2_SHDWCMODE_MAX                                         (0x0001U)

#define PWM_EPWM_CMPCTL2_RESERVED_1_MASK                                       (0x0020U)
#define PWM_EPWM_CMPCTL2_RESERVED_1_SHIFT                                      (0x0005U)
#define PWM_EPWM_CMPCTL2_RESERVED_1_RESETVAL                                   (0x0000U)
#define PWM_EPWM_CMPCTL2_RESERVED_1_MAX                                        (0x0001U)

#define PWM_EPWM_CMPCTL2_SHDWDMODE_MASK                                        (0x0040U)
#define PWM_EPWM_CMPCTL2_SHDWDMODE_SHIFT                                       (0x0006U)
#define PWM_EPWM_CMPCTL2_SHDWDMODE_RESETVAL                                    (0x0000U)
#define PWM_EPWM_CMPCTL2_SHDWDMODE_MAX                                         (0x0001U)

#define PWM_EPWM_CMPCTL2_RESERVED_2_MASK                                       (0x0380U)
#define PWM_EPWM_CMPCTL2_RESERVED_2_SHIFT                                      (0x0007U)
#define PWM_EPWM_CMPCTL2_RESERVED_2_RESETVAL                                   (0x0000U)
#define PWM_EPWM_CMPCTL2_RESERVED_2_MAX                                        (0x0007U)

#define PWM_EPWM_CMPCTL2_LOADCSYNC_MASK                                        (0x0C00U)
#define PWM_EPWM_CMPCTL2_LOADCSYNC_SHIFT                                       (0x000AU)
#define PWM_EPWM_CMPCTL2_LOADCSYNC_RESETVAL                                    (0x0000U)
#define PWM_EPWM_CMPCTL2_LOADCSYNC_MAX                                         (0x0003U)

#define PWM_EPWM_CMPCTL2_LOADDSYNC_MASK                                        (0x3000U)
#define PWM_EPWM_CMPCTL2_LOADDSYNC_SHIFT                                       (0x000CU)
#define PWM_EPWM_CMPCTL2_LOADDSYNC_RESETVAL                                    (0x0000U)
#define PWM_EPWM_CMPCTL2_LOADDSYNC_MAX                                         (0x0003U)

#define PWM_EPWM_CMPCTL2_RESERVED_3_MASK                                       (0xC000U)
#define PWM_EPWM_CMPCTL2_RESERVED_3_SHIFT                                      (0x000EU)
#define PWM_EPWM_CMPCTL2_RESERVED_3_RESETVAL                                   (0x0000U)
#define PWM_EPWM_CMPCTL2_RESERVED_3_MAX                                        (0x0003U)

#define PWM_EPWM_CMPCTL2_RESETVAL                                              (0x0000U)

/* RESERVED_2 */

#define PWM_EPWM_RESERVED_2_UNNAMED_MASK                                       (0x0001U)
#define PWM_EPWM_RESERVED_2_UNNAMED_SHIFT                                      (0x0000U)
#define PWM_EPWM_RESERVED_2_UNNAMED_RESETVAL                                   (0x0000U)
#define PWM_EPWM_RESERVED_2_UNNAMED_MAX                                        (0x0001U)

#define PWM_EPWM_RESERVED_2_RESETVAL                                           (0x0000U)

/* DBCTL */

#define PWM_EPWM_DBCTL_OUT_MODE_MASK                                           (0x0003U)
#define PWM_EPWM_DBCTL_OUT_MODE_SHIFT                                          (0x0000U)
#define PWM_EPWM_DBCTL_OUT_MODE_RESETVAL                                       (0x0000U)
#define PWM_EPWM_DBCTL_OUT_MODE_MAX                                            (0x0003U)

#define PWM_EPWM_DBCTL_POLSEL_MASK                                             (0x000CU)
#define PWM_EPWM_DBCTL_POLSEL_SHIFT                                            (0x0002U)
#define PWM_EPWM_DBCTL_POLSEL_RESETVAL                                         (0x0000U)
#define PWM_EPWM_DBCTL_POLSEL_MAX                                              (0x0003U)

#define PWM_EPWM_DBCTL_IN_MODE_MASK                                            (0x0030U)
#define PWM_EPWM_DBCTL_IN_MODE_SHIFT                                           (0x0004U)
#define PWM_EPWM_DBCTL_IN_MODE_RESETVAL                                        (0x0000U)
#define PWM_EPWM_DBCTL_IN_MODE_MAX                                             (0x0003U)

#define PWM_EPWM_DBCTL_LOADREDMODE_MASK                                        (0x00C0U)
#define PWM_EPWM_DBCTL_LOADREDMODE_SHIFT                                       (0x0006U)
#define PWM_EPWM_DBCTL_LOADREDMODE_RESETVAL                                    (0x0000U)
#define PWM_EPWM_DBCTL_LOADREDMODE_MAX                                         (0x0003U)

#define PWM_EPWM_DBCTL_LOADFEDMODE_MASK                                        (0x0300U)
#define PWM_EPWM_DBCTL_LOADFEDMODE_SHIFT                                       (0x0008U)
#define PWM_EPWM_DBCTL_LOADFEDMODE_RESETVAL                                    (0x0000U)
#define PWM_EPWM_DBCTL_LOADFEDMODE_MAX                                         (0x0003U)

#define PWM_EPWM_DBCTL_SHDWDBREDMODE_MASK                                      (0x0400U)
#define PWM_EPWM_DBCTL_SHDWDBREDMODE_SHIFT                                     (0x000AU)
#define PWM_EPWM_DBCTL_SHDWDBREDMODE_RESETVAL                                  (0x0000U)
#define PWM_EPWM_DBCTL_SHDWDBREDMODE_MAX                                       (0x0001U)

#define PWM_EPWM_DBCTL_SHDWDBFEDMODE_MASK                                      (0x0800U)
#define PWM_EPWM_DBCTL_SHDWDBFEDMODE_SHIFT                                     (0x000BU)
#define PWM_EPWM_DBCTL_SHDWDBFEDMODE_RESETVAL                                  (0x0000U)
#define PWM_EPWM_DBCTL_SHDWDBFEDMODE_MAX                                       (0x0001U)

#define PWM_EPWM_DBCTL_OUTSWAP_MASK                                            (0x3000U)
#define PWM_EPWM_DBCTL_OUTSWAP_SHIFT                                           (0x000CU)
#define PWM_EPWM_DBCTL_OUTSWAP_RESETVAL                                        (0x0000U)
#define PWM_EPWM_DBCTL_OUTSWAP_MAX                                             (0x0003U)

#define PWM_EPWM_DBCTL_DEDB_MODE_MASK                                          (0x4000U)
#define PWM_EPWM_DBCTL_DEDB_MODE_SHIFT                                         (0x000EU)
#define PWM_EPWM_DBCTL_DEDB_MODE_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DBCTL_DEDB_MODE_MAX                                           (0x0001U)

#define PWM_EPWM_DBCTL_HALFCYCLE_MASK                                          (0x8000U)
#define PWM_EPWM_DBCTL_HALFCYCLE_SHIFT                                         (0x000FU)
#define PWM_EPWM_DBCTL_HALFCYCLE_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DBCTL_HALFCYCLE_MAX                                           (0x0001U)

#define PWM_EPWM_DBCTL_RESETVAL                                                (0x0000U)

