TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
/* RESERVED_9 */

#define PWM_EPWM_RESERVED_9_UNNAMED_MASK                                       (0x0001U)
#define PWM_EPWM_RESERVED_9_UNNAMED_SHIFT                                      (0x0000U)
#define PWM_EPWM_RESERVED_9_UNNAMED_RESETVAL                                   (0x0000U)
#define PWM_EPWM_RESERVED_9_UNNAMED_MAX                                        (0x0001U)

#define PWM_EPWM_RESERVED_9_RESETVAL                                           (0x0000U)

/* RESERVED_10 */

#define PWM_EPWM_RESERVED_10_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_10_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_10_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_10_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_10_RESETVAL                                          (0x0000U)

/* RESERVED_11 */

#define PWM_EPWM_RESERVED_11_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_11_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_11_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_11_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_11_RESETVAL                                          (0x0000U)

/* RESERVED_12 */

#define PWM_EPWM_RESERVED_12_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_12_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_12_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_12_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_12_RESETVAL                                          (0x0000U)

/* HRCNFG2 */

#define PWM_EPWM_HRCNFG2_EDGMODEDB_MASK                                        (0x0003U)
#define PWM_EPWM_HRCNFG2_EDGMODEDB_SHIFT                                       (0x0000U)
#define PWM_EPWM_HRCNFG2_EDGMODEDB_RESETVAL                                    (0x0000U)
#define PWM_EPWM_HRCNFG2_EDGMODEDB_MAX                                         (0x0003U)

#define PWM_EPWM_HRCNFG2_CTLMODEDBRED_MASK                                     (0x000CU)
#define PWM_EPWM_HRCNFG2_CTLMODEDBRED_SHIFT                                    (0x0002U)
#define PWM_EPWM_HRCNFG2_CTLMODEDBRED_RESETVAL                                 (0x0000U)
#define PWM_EPWM_HRCNFG2_CTLMODEDBRED_MAX                                      (0x0003U)

#define PWM_EPWM_HRCNFG2_CTLMODEDBFED_MASK                                     (0x0030U)
#define PWM_EPWM_HRCNFG2_CTLMODEDBFED_SHIFT                                    (0x0004U)
#define PWM_EPWM_HRCNFG2_CTLMODEDBFED_RESETVAL                                 (0x0000U)
#define PWM_EPWM_HRCNFG2_CTLMODEDBFED_MAX                                      (0x0003U)

#define PWM_EPWM_HRCNFG2_RESERVED_1_MASK                                       (0x3FC0U)
#define PWM_EPWM_HRCNFG2_RESERVED_1_SHIFT                                      (0x0006U)
#define PWM_EPWM_HRCNFG2_RESERVED_1_RESETVAL                                   (0x0000U)
#define PWM_EPWM_HRCNFG2_RESERVED_1_MAX                                        (0x00FFU)

#define PWM_EPWM_HRCNFG2_DELLOADFRC_MASK                                       (0x4000U)
#define PWM_EPWM_HRCNFG2_DELLOADFRC_SHIFT                                      (0x000EU)
#define PWM_EPWM_HRCNFG2_DELLOADFRC_RESETVAL                                   (0x0000U)
#define PWM_EPWM_HRCNFG2_DELLOADFRC_MAX                                        (0x0001U)

#define PWM_EPWM_HRCNFG2_NOBYPASS_MASK                                         (0x8000U)
#define PWM_EPWM_HRCNFG2_NOBYPASS_SHIFT                                        (0x000FU)
#define PWM_EPWM_HRCNFG2_NOBYPASS_RESETVAL                                     (0x0000U)
#define PWM_EPWM_HRCNFG2_NOBYPASS_MAX                                          (0x0001U)

#define PWM_EPWM_HRCNFG2_RESETVAL                                              (0x0000U)

/* RESERVED_13 */

#define PWM_EPWM_RESERVED_13_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_13_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_13_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_13_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_13_RESETVAL                                          (0x0000U)

/* HRPCTL */

#define PWM_EPWM_HRPCTL_HRPE_MASK                                              (0x0001U)
#define PWM_EPWM_HRPCTL_HRPE_SHIFT                                             (0x0000U)
#define PWM_EPWM_HRPCTL_HRPE_RESETVAL                                          (0x0000U)
#define PWM_EPWM_HRPCTL_HRPE_MAX                                               (0x0001U)

#define PWM_EPWM_HRPCTL_PWMSYNCSEL_MASK                                        (0x0002U)
#define PWM_EPWM_HRPCTL_PWMSYNCSEL_SHIFT                                       (0x0001U)
#define PWM_EPWM_HRPCTL_PWMSYNCSEL_RESETVAL                                    (0x0000U)
#define PWM_EPWM_HRPCTL_PWMSYNCSEL_MAX                                         (0x0001U)

#define PWM_EPWM_HRPCTL_TBPHSHRLOADE_MASK                                      (0x0004U)
#define PWM_EPWM_HRPCTL_TBPHSHRLOADE_SHIFT                                     (0x0002U)
#define PWM_EPWM_HRPCTL_TBPHSHRLOADE_RESETVAL                                  (0x0000U)
#define PWM_EPWM_HRPCTL_TBPHSHRLOADE_MAX                                       (0x0001U)

#define PWM_EPWM_HRPCTL_HRPSYNCE_MASK                                          (0x0008U)
#define PWM_EPWM_HRPCTL_HRPSYNCE_SHIFT                                         (0x0003U)
#define PWM_EPWM_HRPCTL_HRPSYNCE_RESETVAL                                      (0x0000U)
#define PWM_EPWM_HRPCTL_HRPSYNCE_MAX                                           (0x0001U)

