TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_GLDCFG_DBFED_DBFEDHR_MASK                                     (0x0040U)
#define PWM_EPWM_GLDCFG_DBFED_DBFEDHR_SHIFT                                    (0x0006U)
#define PWM_EPWM_GLDCFG_DBFED_DBFEDHR_RESETVAL                                 (0x0000U)
#define PWM_EPWM_GLDCFG_DBFED_DBFEDHR_MAX                                      (0x0001U)

#define PWM_EPWM_GLDCFG_DBCTL_MASK                                             (0x0080U)
#define PWM_EPWM_GLDCFG_DBCTL_SHIFT                                            (0x0007U)
#define PWM_EPWM_GLDCFG_DBCTL_RESETVAL                                         (0x0000U)
#define PWM_EPWM_GLDCFG_DBCTL_MAX                                              (0x0001U)

#define PWM_EPWM_GLDCFG_AQCTLA_AQCTLA2_MASK                                    (0x0100U)
#define PWM_EPWM_GLDCFG_AQCTLA_AQCTLA2_SHIFT                                   (0x0008U)
#define PWM_EPWM_GLDCFG_AQCTLA_AQCTLA2_RESETVAL                                (0x0000U)
#define PWM_EPWM_GLDCFG_AQCTLA_AQCTLA2_MAX                                     (0x0001U)

#define PWM_EPWM_GLDCFG_AQCTLB_AQCTLB2_MASK                                    (0x0200U)
#define PWM_EPWM_GLDCFG_AQCTLB_AQCTLB2_SHIFT                                   (0x0009U)
#define PWM_EPWM_GLDCFG_AQCTLB_AQCTLB2_RESETVAL                                (0x0000U)
#define PWM_EPWM_GLDCFG_AQCTLB_AQCTLB2_MAX                                     (0x0001U)

#define PWM_EPWM_GLDCFG_AQCSFRC_MASK                                           (0x0400U)
#define PWM_EPWM_GLDCFG_AQCSFRC_SHIFT                                          (0x000AU)
#define PWM_EPWM_GLDCFG_AQCSFRC_RESETVAL                                       (0x0000U)
#define PWM_EPWM_GLDCFG_AQCSFRC_MAX                                            (0x0001U)

#define PWM_EPWM_GLDCFG_RESERVED_1_MASK                                        (0xF800U)
#define PWM_EPWM_GLDCFG_RESERVED_1_SHIFT                                       (0x000BU)
#define PWM_EPWM_GLDCFG_RESERVED_1_RESETVAL                                    (0x0000U)
#define PWM_EPWM_GLDCFG_RESERVED_1_MAX                                         (0x001FU)

#define PWM_EPWM_GLDCFG_RESETVAL                                               (0x0000U)

/* RESERVED_15 */

#define PWM_EPWM_RESERVED_15_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_15_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_15_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_15_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_15_RESETVAL                                          (0x0000U)

/* EPWMXLINK */

#define PWM_EPWM_EPWMXLINK_TBPRDLINK_MASK                                      (0x0000001FU)
#define PWM_EPWM_EPWMXLINK_TBPRDLINK_SHIFT                                     (0x00000000U)
#define PWM_EPWM_EPWMXLINK_TBPRDLINK_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_EPWMXLINK_TBPRDLINK_MAX                                       (0x0000001FU)

#define PWM_EPWM_EPWMXLINK_CMPALINK_MASK                                       (0x000003E0U)
#define PWM_EPWM_EPWMXLINK_CMPALINK_SHIFT                                      (0x00000005U)
#define PWM_EPWM_EPWMXLINK_CMPALINK_RESETVAL                                   (0x00000000U)
#define PWM_EPWM_EPWMXLINK_CMPALINK_MAX                                        (0x0000001FU)

#define PWM_EPWM_EPWMXLINK_CMPBLINK_MASK                                       (0x00007C00U)
#define PWM_EPWM_EPWMXLINK_CMPBLINK_SHIFT                                      (0x0000000AU)
#define PWM_EPWM_EPWMXLINK_CMPBLINK_RESETVAL                                   (0x00000000U)
#define PWM_EPWM_EPWMXLINK_CMPBLINK_MAX                                        (0x0000001FU)

#define PWM_EPWM_EPWMXLINK_RESERVED_1_MASK                                     (0x00008000U)
#define PWM_EPWM_EPWMXLINK_RESERVED_1_SHIFT                                    (0x0000000FU)
#define PWM_EPWM_EPWMXLINK_RESERVED_1_RESETVAL                                 (0x00000000U)
#define PWM_EPWM_EPWMXLINK_RESERVED_1_MAX                                      (0x00000001U)

#define PWM_EPWM_EPWMXLINK_CMPCLINK_MASK                                       (0x001F0000U)
#define PWM_EPWM_EPWMXLINK_CMPCLINK_SHIFT                                      (0x00000010U)
#define PWM_EPWM_EPWMXLINK_CMPCLINK_RESETVAL                                   (0x00000000U)
#define PWM_EPWM_EPWMXLINK_CMPCLINK_MAX                                        (0x0000001FU)

#define PWM_EPWM_EPWMXLINK_CMPDLINK_MASK                                       (0x03E00000U)
#define PWM_EPWM_EPWMXLINK_CMPDLINK_SHIFT                                      (0x00000015U)
#define PWM_EPWM_EPWMXLINK_CMPDLINK_RESETVAL                                   (0x00000000U)
#define PWM_EPWM_EPWMXLINK_CMPDLINK_MAX                                        (0x0000001FU)

#define PWM_EPWM_EPWMXLINK_GLDCTL2LINK_MASK                                    (0x7C000000U)
#define PWM_EPWM_EPWMXLINK_GLDCTL2LINK_SHIFT                                   (0x0000001AU)
#define PWM_EPWM_EPWMXLINK_GLDCTL2LINK_RESETVAL                                (0x00000000U)
#define PWM_EPWM_EPWMXLINK_GLDCTL2LINK_MAX                                     (0x0000001FU)

#define PWM_EPWM_EPWMXLINK_RESERVED_2_MASK                                     (0x80000000U)
#define PWM_EPWM_EPWMXLINK_RESERVED_2_SHIFT                                    (0x0000001FU)
#define PWM_EPWM_EPWMXLINK_RESERVED_2_RESETVAL                                 (0x00000000U)
#define PWM_EPWM_EPWMXLINK_RESERVED_2_MAX                                      (0x00000001U)

#define PWM_EPWM_EPWMXLINK_RESETVAL                                            (0x00000000U)

/* EPWMXLINK2 */

#define PWM_EPWM_EPWMXLINK2_DBREDLINK_MASK                                     (0x0000001FU)
#define PWM_EPWM_EPWMXLINK2_DBREDLINK_SHIFT                                    (0x00000000U)
#define PWM_EPWM_EPWMXLINK2_DBREDLINK_RESETVAL                                 (0x00000000U)
#define PWM_EPWM_EPWMXLINK2_DBREDLINK_MAX                                      (0x0000001FU)

#define PWM_EPWM_EPWMXLINK2_DBFEDLINK_MASK                                     (0x000003E0U)
#define PWM_EPWM_EPWMXLINK2_DBFEDLINK_SHIFT                                    (0x00000005U)
#define PWM_EPWM_EPWMXLINK2_DBFEDLINK_RESETVAL                                 (0x00000000U)
#define PWM_EPWM_EPWMXLINK2_DBFEDLINK_MAX                                      (0x0000001FU)

