TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_AQCTLA2_T1U_MASK                                              (0x0003U)
#define PWM_EPWM_AQCTLA2_T1U_SHIFT                                             (0x0000U)
#define PWM_EPWM_AQCTLA2_T1U_RESETVAL                                          (0x0000U)
#define PWM_EPWM_AQCTLA2_T1U_MAX                                               (0x0003U)

#define PWM_EPWM_AQCTLA2_T1D_MASK                                              (0x000CU)
#define PWM_EPWM_AQCTLA2_T1D_SHIFT                                             (0x0002U)
#define PWM_EPWM_AQCTLA2_T1D_RESETVAL                                          (0x0000U)
#define PWM_EPWM_AQCTLA2_T1D_MAX                                               (0x0003U)

#define PWM_EPWM_AQCTLA2_T2U_MASK                                              (0x0030U)
#define PWM_EPWM_AQCTLA2_T2U_SHIFT                                             (0x0004U)
#define PWM_EPWM_AQCTLA2_T2U_RESETVAL                                          (0x0000U)
#define PWM_EPWM_AQCTLA2_T2U_MAX                                               (0x0003U)

#define PWM_EPWM_AQCTLA2_T2D_MASK                                              (0x00C0U)
#define PWM_EPWM_AQCTLA2_T2D_SHIFT                                             (0x0006U)
#define PWM_EPWM_AQCTLA2_T2D_RESETVAL                                          (0x0000U)
#define PWM_EPWM_AQCTLA2_T2D_MAX                                               (0x0003U)

#define PWM_EPWM_AQCTLA2_RESERVED_1_MASK                                       (0xFF00U)
#define PWM_EPWM_AQCTLA2_RESERVED_1_SHIFT                                      (0x0008U)
#define PWM_EPWM_AQCTLA2_RESERVED_1_RESETVAL                                   (0x0000U)
#define PWM_EPWM_AQCTLA2_RESERVED_1_MAX                                        (0x00FFU)

#define PWM_EPWM_AQCTLA2_RESETVAL                                              (0x0000U)

/* AQCTLB */

#define PWM_EPWM_AQCTLB_ZRO_MASK                                               (0x0003U)
#define PWM_EPWM_AQCTLB_ZRO_SHIFT                                              (0x0000U)
#define PWM_EPWM_AQCTLB_ZRO_RESETVAL                                           (0x0000U)
#define PWM_EPWM_AQCTLB_ZRO_MAX                                                (0x0003U)

#define PWM_EPWM_AQCTLB_PRD_MASK                                               (0x000CU)
#define PWM_EPWM_AQCTLB_PRD_SHIFT                                              (0x0002U)
#define PWM_EPWM_AQCTLB_PRD_RESETVAL                                           (0x0000U)
#define PWM_EPWM_AQCTLB_PRD_MAX                                                (0x0003U)

#define PWM_EPWM_AQCTLB_CAU_MASK                                               (0x0030U)
#define PWM_EPWM_AQCTLB_CAU_SHIFT                                              (0x0004U)
#define PWM_EPWM_AQCTLB_CAU_RESETVAL                                           (0x0000U)
#define PWM_EPWM_AQCTLB_CAU_MAX                                                (0x0003U)

#define PWM_EPWM_AQCTLB_CAD_MASK                                               (0x00C0U)
#define PWM_EPWM_AQCTLB_CAD_SHIFT                                              (0x0006U)
#define PWM_EPWM_AQCTLB_CAD_RESETVAL                                           (0x0000U)
#define PWM_EPWM_AQCTLB_CAD_MAX                                                (0x0003U)

#define PWM_EPWM_AQCTLB_CBU_MASK                                               (0x0300U)
#define PWM_EPWM_AQCTLB_CBU_SHIFT                                              (0x0008U)
#define PWM_EPWM_AQCTLB_CBU_RESETVAL                                           (0x0000U)
#define PWM_EPWM_AQCTLB_CBU_MAX                                                (0x0003U)

#define PWM_EPWM_AQCTLB_CBD_MASK                                               (0x0C00U)
#define PWM_EPWM_AQCTLB_CBD_SHIFT                                              (0x000AU)
#define PWM_EPWM_AQCTLB_CBD_RESETVAL                                           (0x0000U)
#define PWM_EPWM_AQCTLB_CBD_MAX                                                (0x0003U)

#define PWM_EPWM_AQCTLB_RESERVED_1_MASK                                        (0xF000U)
#define PWM_EPWM_AQCTLB_RESERVED_1_SHIFT                                       (0x000CU)
#define PWM_EPWM_AQCTLB_RESERVED_1_RESETVAL                                    (0x0000U)
#define PWM_EPWM_AQCTLB_RESERVED_1_MAX                                         (0x000FU)

#define PWM_EPWM_AQCTLB_RESETVAL                                               (0x0000U)

/* AQCTLB2 */

#define PWM_EPWM_AQCTLB2_T1U_MASK                                              (0x0003U)
#define PWM_EPWM_AQCTLB2_T1U_SHIFT                                             (0x0000U)
#define PWM_EPWM_AQCTLB2_T1U_RESETVAL                                          (0x0000U)
#define PWM_EPWM_AQCTLB2_T1U_MAX                                               (0x0003U)

#define PWM_EPWM_AQCTLB2_T1D_MASK                                              (0x000CU)
#define PWM_EPWM_AQCTLB2_T1D_SHIFT                                             (0x0002U)
#define PWM_EPWM_AQCTLB2_T1D_RESETVAL                                          (0x0000U)
#define PWM_EPWM_AQCTLB2_T1D_MAX                                               (0x0003U)

#define PWM_EPWM_AQCTLB2_T2U_MASK                                              (0x0030U)
#define PWM_EPWM_AQCTLB2_T2U_SHIFT                                             (0x0004U)
#define PWM_EPWM_AQCTLB2_T2U_RESETVAL                                          (0x0000U)
#define PWM_EPWM_AQCTLB2_T2U_MAX                                               (0x0003U)

#define PWM_EPWM_AQCTLB2_T2D_MASK                                              (0x00C0U)
#define PWM_EPWM_AQCTLB2_T2D_SHIFT                                             (0x0006U)
#define PWM_EPWM_AQCTLB2_T2D_RESETVAL                                          (0x0000U)
#define PWM_EPWM_AQCTLB2_T2D_MAX                                               (0x0003U)

#define PWM_EPWM_AQCTLB2_RESERVED_1_MASK                                       (0xFF00U)
#define PWM_EPWM_AQCTLB2_RESERVED_1_SHIFT                                      (0x0008U)
#define PWM_EPWM_AQCTLB2_RESERVED_1_RESETVAL                                   (0x0000U)
#define PWM_EPWM_AQCTLB2_RESERVED_1_MAX                                        (0x00FFU)

#define PWM_EPWM_AQCTLB2_RESETVAL                                              (0x0000U)

/* RESERVED_17 */

#define PWM_EPWM_RESERVED_17_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_17_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_17_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_17_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_17_RESETVAL                                          (0x0000U)

/* AQSFRC */

