TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_TZEINT_RESERVED_1_MASK                                        (0x0001U)
#define PWM_EPWM_TZEINT_RESERVED_1_SHIFT                                       (0x0000U)
#define PWM_EPWM_TZEINT_RESERVED_1_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TZEINT_RESERVED_1_MAX                                         (0x0001U)

#define PWM_EPWM_TZEINT_CBC_MASK                                               (0x0002U)
#define PWM_EPWM_TZEINT_CBC_SHIFT                                              (0x0001U)
#define PWM_EPWM_TZEINT_CBC_RESETVAL                                           (0x0000U)
#define PWM_EPWM_TZEINT_CBC_MAX                                                (0x0001U)

#define PWM_EPWM_TZEINT_OST_MASK                                               (0x0004U)
#define PWM_EPWM_TZEINT_OST_SHIFT                                              (0x0002U)
#define PWM_EPWM_TZEINT_OST_RESETVAL                                           (0x0000U)
#define PWM_EPWM_TZEINT_OST_MAX                                                (0x0001U)

#define PWM_EPWM_TZEINT_DCAEVT1_MASK                                           (0x0008U)
#define PWM_EPWM_TZEINT_DCAEVT1_SHIFT                                          (0x0003U)
#define PWM_EPWM_TZEINT_DCAEVT1_RESETVAL                                       (0x0000U)
#define PWM_EPWM_TZEINT_DCAEVT1_MAX                                            (0x0001U)

#define PWM_EPWM_TZEINT_DCAEVT2_MASK                                           (0x0010U)
#define PWM_EPWM_TZEINT_DCAEVT2_SHIFT                                          (0x0004U)
#define PWM_EPWM_TZEINT_DCAEVT2_RESETVAL                                       (0x0000U)
#define PWM_EPWM_TZEINT_DCAEVT2_MAX                                            (0x0001U)

#define PWM_EPWM_TZEINT_DCBEVT1_MASK                                           (0x0020U)
#define PWM_EPWM_TZEINT_DCBEVT1_SHIFT                                          (0x0005U)
#define PWM_EPWM_TZEINT_DCBEVT1_RESETVAL                                       (0x0000U)
#define PWM_EPWM_TZEINT_DCBEVT1_MAX                                            (0x0001U)

#define PWM_EPWM_TZEINT_DCBEVT2_MASK                                           (0x0040U)
#define PWM_EPWM_TZEINT_DCBEVT2_SHIFT                                          (0x0006U)
#define PWM_EPWM_TZEINT_DCBEVT2_RESETVAL                                       (0x0000U)
#define PWM_EPWM_TZEINT_DCBEVT2_MAX                                            (0x0001U)

#define PWM_EPWM_TZEINT_CAPEVT_MASK                                            (0x0080U)
#define PWM_EPWM_TZEINT_CAPEVT_SHIFT                                           (0x0007U)
#define PWM_EPWM_TZEINT_CAPEVT_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TZEINT_CAPEVT_MAX                                             (0x0001U)

#define PWM_EPWM_TZEINT_RESERVED_2_MASK                                        (0xFF00U)
#define PWM_EPWM_TZEINT_RESERVED_2_SHIFT                                       (0x0008U)
#define PWM_EPWM_TZEINT_RESERVED_2_RESETVAL                                    (0x0000U)
#define PWM_EPWM_TZEINT_RESERVED_2_MAX                                         (0x00FFU)

#define PWM_EPWM_TZEINT_RESETVAL                                               (0x0000U)

/* RESERVED_29 */

#define PWM_EPWM_RESERVED_29_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_29_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_29_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_29_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_29_RESETVAL                                          (0x0000U)

/* TZFLG */

#define PWM_EPWM_TZFLG_INT_MASK                                                (0x0001U)
#define PWM_EPWM_TZFLG_INT_SHIFT                                               (0x0000U)
#define PWM_EPWM_TZFLG_INT_RESETVAL                                            (0x0000U)
#define PWM_EPWM_TZFLG_INT_MAX                                                 (0x0001U)

#define PWM_EPWM_TZFLG_CBC_MASK                                                (0x0002U)
#define PWM_EPWM_TZFLG_CBC_SHIFT                                               (0x0001U)
#define PWM_EPWM_TZFLG_CBC_RESETVAL                                            (0x0000U)
#define PWM_EPWM_TZFLG_CBC_MAX                                                 (0x0001U)

#define PWM_EPWM_TZFLG_OST_MASK                                                (0x0004U)
#define PWM_EPWM_TZFLG_OST_SHIFT                                               (0x0002U)
#define PWM_EPWM_TZFLG_OST_RESETVAL                                            (0x0000U)
#define PWM_EPWM_TZFLG_OST_MAX                                                 (0x0001U)

#define PWM_EPWM_TZFLG_DCAEVT1_MASK                                            (0x0008U)
#define PWM_EPWM_TZFLG_DCAEVT1_SHIFT                                           (0x0003U)
#define PWM_EPWM_TZFLG_DCAEVT1_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TZFLG_DCAEVT1_MAX                                             (0x0001U)

#define PWM_EPWM_TZFLG_DCAEVT2_MASK                                            (0x0010U)
#define PWM_EPWM_TZFLG_DCAEVT2_SHIFT                                           (0x0004U)
#define PWM_EPWM_TZFLG_DCAEVT2_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TZFLG_DCAEVT2_MAX                                             (0x0001U)

#define PWM_EPWM_TZFLG_DCBEVT1_MASK                                            (0x0020U)
#define PWM_EPWM_TZFLG_DCBEVT1_SHIFT                                           (0x0005U)
#define PWM_EPWM_TZFLG_DCBEVT1_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TZFLG_DCBEVT1_MAX                                             (0x0001U)

#define PWM_EPWM_TZFLG_DCBEVT2_MASK                                            (0x0040U)
#define PWM_EPWM_TZFLG_DCBEVT2_SHIFT                                           (0x0006U)
#define PWM_EPWM_TZFLG_DCBEVT2_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TZFLG_DCBEVT2_MAX                                             (0x0001U)

#define PWM_EPWM_TZFLG_CAPEVT_MASK                                             (0x0080U)
#define PWM_EPWM_TZFLG_CAPEVT_SHIFT                                            (0x0007U)
#define PWM_EPWM_TZFLG_CAPEVT_RESETVAL                                         (0x0000U)
#define PWM_EPWM_TZFLG_CAPEVT_MAX                                              (0x0001U)

#define PWM_EPWM_TZFLG_RESERVED_1_MASK                                         (0xFF00U)
#define PWM_EPWM_TZFLG_RESERVED_1_SHIFT                                        (0x0008U)
#define PWM_EPWM_TZFLG_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_TZFLG_RESERVED_1_MAX                                          (0x00FFU)

#define PWM_EPWM_TZFLG_RESETVAL                                                (0x0000U)

/* TZCBCFLG */

#define PWM_EPWM_TZCBCFLG_CBC1_MASK                                            (0x0001U)
#define PWM_EPWM_TZCBCFLG_CBC1_SHIFT                                           (0x0000U)
#define PWM_EPWM_TZCBCFLG_CBC1_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TZCBCFLG_CBC1_MAX                                             (0x0001U)

#define PWM_EPWM_TZCBCFLG_CBC2_MASK                                            (0x0002U)
#define PWM_EPWM_TZCBCFLG_CBC2_SHIFT                                           (0x0001U)
#define PWM_EPWM_TZCBCFLG_CBC2_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TZCBCFLG_CBC2_MAX                                             (0x0001U)

#define PWM_EPWM_TZCBCFLG_CBC3_MASK                                            (0x0004U)
#define PWM_EPWM_TZCBCFLG_CBC3_SHIFT                                           (0x0002U)
#define PWM_EPWM_TZCBCFLG_CBC3_RESETVAL                                        (0x0000U)
#define PWM_EPWM_TZCBCFLG_CBC3_MAX                                             (0x0001U)

