TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
/* RESERVED_33 */

#define PWM_EPWM_RESERVED_33_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_33_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_33_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_33_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_33_RESETVAL                                          (0x0000U)

/* ETSEL */

#define PWM_EPWM_ETSEL_INTSEL_MASK                                             (0x0007U)
#define PWM_EPWM_ETSEL_INTSEL_SHIFT                                            (0x0000U)
#define PWM_EPWM_ETSEL_INTSEL_RESETVAL                                         (0x0000U)
#define PWM_EPWM_ETSEL_INTSEL_MAX                                              (0x0007U)

#define PWM_EPWM_ETSEL_INTEN_MASK                                              (0x0008U)
#define PWM_EPWM_ETSEL_INTEN_SHIFT                                             (0x0003U)
#define PWM_EPWM_ETSEL_INTEN_RESETVAL                                          (0x0000U)
#define PWM_EPWM_ETSEL_INTEN_MAX                                               (0x0001U)

#define PWM_EPWM_ETSEL_SOCASELCMP_MASK                                         (0x0010U)
#define PWM_EPWM_ETSEL_SOCASELCMP_SHIFT                                        (0x0004U)
#define PWM_EPWM_ETSEL_SOCASELCMP_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETSEL_SOCASELCMP_MAX                                          (0x0001U)

#define PWM_EPWM_ETSEL_SOCBSELCMP_MASK                                         (0x0020U)
#define PWM_EPWM_ETSEL_SOCBSELCMP_SHIFT                                        (0x0005U)
#define PWM_EPWM_ETSEL_SOCBSELCMP_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETSEL_SOCBSELCMP_MAX                                          (0x0001U)

#define PWM_EPWM_ETSEL_INTSELCMP_MASK                                          (0x0040U)
#define PWM_EPWM_ETSEL_INTSELCMP_SHIFT                                         (0x0006U)
#define PWM_EPWM_ETSEL_INTSELCMP_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSEL_INTSELCMP_MAX                                           (0x0001U)

#define PWM_EPWM_ETSEL_RESERVED_1_MASK                                         (0x0080U)
#define PWM_EPWM_ETSEL_RESERVED_1_SHIFT                                        (0x0007U)
#define PWM_EPWM_ETSEL_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETSEL_RESERVED_1_MAX                                          (0x0001U)

#define PWM_EPWM_ETSEL_SOCASEL_MASK                                            (0x0700U)
#define PWM_EPWM_ETSEL_SOCASEL_SHIFT                                           (0x0008U)
#define PWM_EPWM_ETSEL_SOCASEL_RESETVAL                                        (0x0000U)
#define PWM_EPWM_ETSEL_SOCASEL_MAX                                             (0x0007U)

#define PWM_EPWM_ETSEL_SOCAEN_MASK                                             (0x0800U)
#define PWM_EPWM_ETSEL_SOCAEN_SHIFT                                            (0x000BU)
#define PWM_EPWM_ETSEL_SOCAEN_RESETVAL                                         (0x0000U)
#define PWM_EPWM_ETSEL_SOCAEN_MAX                                              (0x0001U)

#define PWM_EPWM_ETSEL_SOCBSEL_MASK                                            (0x7000U)
#define PWM_EPWM_ETSEL_SOCBSEL_SHIFT                                           (0x000CU)
#define PWM_EPWM_ETSEL_SOCBSEL_RESETVAL                                        (0x0000U)
#define PWM_EPWM_ETSEL_SOCBSEL_MAX                                             (0x0007U)

#define PWM_EPWM_ETSEL_SOCBEN_MASK                                             (0x8000U)
#define PWM_EPWM_ETSEL_SOCBEN_SHIFT                                            (0x000FU)
#define PWM_EPWM_ETSEL_SOCBEN_RESETVAL                                         (0x0000U)
#define PWM_EPWM_ETSEL_SOCBEN_MAX                                              (0x0001U)

#define PWM_EPWM_ETSEL_RESETVAL                                                (0x0000U)

/* RESERVED_34 */

#define PWM_EPWM_RESERVED_34_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_34_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_34_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_34_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_34_RESETVAL                                          (0x0000U)

/* ETPS */

#define PWM_EPWM_ETPS_INTPRD_MASK                                              (0x0003U)
#define PWM_EPWM_ETPS_INTPRD_SHIFT                                             (0x0000U)
#define PWM_EPWM_ETPS_INTPRD_RESETVAL                                          (0x0000U)
#define PWM_EPWM_ETPS_INTPRD_MAX                                               (0x0003U)

#define PWM_EPWM_ETPS_INTCNT_MASK                                              (0x000CU)
#define PWM_EPWM_ETPS_INTCNT_SHIFT                                             (0x0002U)
#define PWM_EPWM_ETPS_INTCNT_RESETVAL                                          (0x0000U)
#define PWM_EPWM_ETPS_INTCNT_MAX                                               (0x0003U)

#define PWM_EPWM_ETPS_INTPSSEL_MASK                                            (0x0010U)
#define PWM_EPWM_ETPS_INTPSSEL_SHIFT                                           (0x0004U)
#define PWM_EPWM_ETPS_INTPSSEL_RESETVAL                                        (0x0000U)
#define PWM_EPWM_ETPS_INTPSSEL_MAX                                             (0x0001U)

#define PWM_EPWM_ETPS_SOCPSSEL_MASK                                            (0x0020U)
#define PWM_EPWM_ETPS_SOCPSSEL_SHIFT                                           (0x0005U)
#define PWM_EPWM_ETPS_SOCPSSEL_RESETVAL                                        (0x0000U)
#define PWM_EPWM_ETPS_SOCPSSEL_MAX                                             (0x0001U)

