TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_ETPS_RESERVED_1_MASK                                          (0x00C0U)
#define PWM_EPWM_ETPS_RESERVED_1_SHIFT                                         (0x0006U)
#define PWM_EPWM_ETPS_RESERVED_1_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETPS_RESERVED_1_MAX                                           (0x0003U)

#define PWM_EPWM_ETPS_SOCAPRD_MASK                                             (0x0300U)
#define PWM_EPWM_ETPS_SOCAPRD_SHIFT                                            (0x0008U)
#define PWM_EPWM_ETPS_SOCAPRD_RESETVAL                                         (0x0000U)
#define PWM_EPWM_ETPS_SOCAPRD_MAX                                              (0x0003U)

#define PWM_EPWM_ETPS_SOCACNT_MASK                                             (0x0C00U)
#define PWM_EPWM_ETPS_SOCACNT_SHIFT                                            (0x000AU)
#define PWM_EPWM_ETPS_SOCACNT_RESETVAL                                         (0x0000U)
#define PWM_EPWM_ETPS_SOCACNT_MAX                                              (0x0003U)

#define PWM_EPWM_ETPS_SOCBPRD_MASK                                             (0x3000U)
#define PWM_EPWM_ETPS_SOCBPRD_SHIFT                                            (0x000CU)
#define PWM_EPWM_ETPS_SOCBPRD_RESETVAL                                         (0x0000U)
#define PWM_EPWM_ETPS_SOCBPRD_MAX                                              (0x0003U)

#define PWM_EPWM_ETPS_SOCBCNT_MASK                                             (0xC000U)
#define PWM_EPWM_ETPS_SOCBCNT_SHIFT                                            (0x000EU)
#define PWM_EPWM_ETPS_SOCBCNT_RESETVAL                                         (0x0000U)
#define PWM_EPWM_ETPS_SOCBCNT_MAX                                              (0x0003U)

#define PWM_EPWM_ETPS_RESETVAL                                                 (0x0000U)

/* RESERVED_35 */

#define PWM_EPWM_RESERVED_35_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_35_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_35_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_35_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_35_RESETVAL                                          (0x0000U)

/* ETFLG */

#define PWM_EPWM_ETFLG_INT_MASK                                                (0x0001U)
#define PWM_EPWM_ETFLG_INT_SHIFT                                               (0x0000U)
#define PWM_EPWM_ETFLG_INT_RESETVAL                                            (0x0000U)
#define PWM_EPWM_ETFLG_INT_MAX                                                 (0x0001U)

#define PWM_EPWM_ETFLG_RESERVED_1_MASK                                         (0x0002U)
#define PWM_EPWM_ETFLG_RESERVED_1_SHIFT                                        (0x0001U)
#define PWM_EPWM_ETFLG_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETFLG_RESERVED_1_MAX                                          (0x0001U)

#define PWM_EPWM_ETFLG_SOCA_MASK                                               (0x0004U)
#define PWM_EPWM_ETFLG_SOCA_SHIFT                                              (0x0002U)
#define PWM_EPWM_ETFLG_SOCA_RESETVAL                                           (0x0000U)
#define PWM_EPWM_ETFLG_SOCA_MAX                                                (0x0001U)

#define PWM_EPWM_ETFLG_SOCB_MASK                                               (0x0008U)
#define PWM_EPWM_ETFLG_SOCB_SHIFT                                              (0x0003U)
#define PWM_EPWM_ETFLG_SOCB_RESETVAL                                           (0x0000U)
#define PWM_EPWM_ETFLG_SOCB_MAX                                                (0x0001U)

#define PWM_EPWM_ETFLG_RESERVED_2_MASK                                         (0xFFF0U)
#define PWM_EPWM_ETFLG_RESERVED_2_SHIFT                                        (0x0004U)
#define PWM_EPWM_ETFLG_RESERVED_2_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETFLG_RESERVED_2_MAX                                          (0x0FFFU)

#define PWM_EPWM_ETFLG_RESETVAL                                                (0x0000U)

/* RESERVED_36 */

#define PWM_EPWM_RESERVED_36_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_36_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_36_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_36_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_36_RESETVAL                                          (0x0000U)

/* ETCLR */

#define PWM_EPWM_ETCLR_INT_MASK                                                (0x0001U)
#define PWM_EPWM_ETCLR_INT_SHIFT                                               (0x0000U)
#define PWM_EPWM_ETCLR_INT_RESETVAL                                            (0x0000U)
#define PWM_EPWM_ETCLR_INT_MAX                                                 (0x0001U)

#define PWM_EPWM_ETCLR_RESERVED_1_MASK                                         (0x0002U)
#define PWM_EPWM_ETCLR_RESERVED_1_SHIFT                                        (0x0001U)
#define PWM_EPWM_ETCLR_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETCLR_RESERVED_1_MAX                                          (0x0001U)

#define PWM_EPWM_ETCLR_SOCA_MASK                                               (0x0004U)
#define PWM_EPWM_ETCLR_SOCA_SHIFT                                              (0x0002U)
#define PWM_EPWM_ETCLR_SOCA_RESETVAL                                           (0x0000U)
#define PWM_EPWM_ETCLR_SOCA_MAX                                                (0x0001U)

#define PWM_EPWM_ETCLR_SOCB_MASK                                               (0x0008U)
#define PWM_EPWM_ETCLR_SOCB_SHIFT                                              (0x0003U)
#define PWM_EPWM_ETCLR_SOCB_RESETVAL                                           (0x0000U)
#define PWM_EPWM_ETCLR_SOCB_MAX                                                (0x0001U)

#define PWM_EPWM_ETCLR_RESERVED_2_MASK                                         (0xFFF0U)
#define PWM_EPWM_ETCLR_RESERVED_2_SHIFT                                        (0x0004U)
#define PWM_EPWM_ETCLR_RESERVED_2_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETCLR_RESERVED_2_MAX                                          (0x0FFFU)

#define PWM_EPWM_ETCLR_RESETVAL                                                (0x0000U)

/* RESERVED_37 */

#define PWM_EPWM_RESERVED_37_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_37_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_37_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_37_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_37_RESETVAL                                          (0x0000U)

/* ETFRC */

