TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_ETFRC_INT_MASK                                                (0x0001U)
#define PWM_EPWM_ETFRC_INT_SHIFT                                               (0x0000U)
#define PWM_EPWM_ETFRC_INT_RESETVAL                                            (0x0000U)
#define PWM_EPWM_ETFRC_INT_MAX                                                 (0x0001U)

#define PWM_EPWM_ETFRC_RESERVED_1_MASK                                         (0x0002U)
#define PWM_EPWM_ETFRC_RESERVED_1_SHIFT                                        (0x0001U)
#define PWM_EPWM_ETFRC_RESERVED_1_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETFRC_RESERVED_1_MAX                                          (0x0001U)

#define PWM_EPWM_ETFRC_SOCA_MASK                                               (0x0004U)
#define PWM_EPWM_ETFRC_SOCA_SHIFT                                              (0x0002U)
#define PWM_EPWM_ETFRC_SOCA_RESETVAL                                           (0x0000U)
#define PWM_EPWM_ETFRC_SOCA_MAX                                                (0x0001U)

#define PWM_EPWM_ETFRC_SOCB_MASK                                               (0x0008U)
#define PWM_EPWM_ETFRC_SOCB_SHIFT                                              (0x0003U)
#define PWM_EPWM_ETFRC_SOCB_RESETVAL                                           (0x0000U)
#define PWM_EPWM_ETFRC_SOCB_MAX                                                (0x0001U)

#define PWM_EPWM_ETFRC_RESERVED_2_MASK                                         (0xFFF0U)
#define PWM_EPWM_ETFRC_RESERVED_2_SHIFT                                        (0x0004U)
#define PWM_EPWM_ETFRC_RESERVED_2_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETFRC_RESERVED_2_MAX                                          (0x0FFFU)

#define PWM_EPWM_ETFRC_RESETVAL                                                (0x0000U)

/* RESERVED_38 */

#define PWM_EPWM_RESERVED_38_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_38_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_38_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_38_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_38_RESETVAL                                          (0x0000U)

/* ETINTPS */

#define PWM_EPWM_ETINTPS_INTPRD2_MASK                                          (0x000FU)
#define PWM_EPWM_ETINTPS_INTPRD2_SHIFT                                         (0x0000U)
#define PWM_EPWM_ETINTPS_INTPRD2_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETINTPS_INTPRD2_MAX                                           (0x000FU)

#define PWM_EPWM_ETINTPS_INTCNT2_MASK                                          (0x00F0U)
#define PWM_EPWM_ETINTPS_INTCNT2_SHIFT                                         (0x0004U)
#define PWM_EPWM_ETINTPS_INTCNT2_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETINTPS_INTCNT2_MAX                                           (0x000FU)

#define PWM_EPWM_ETINTPS_RESERVED_1_MASK                                       (0xFF00U)
#define PWM_EPWM_ETINTPS_RESERVED_1_SHIFT                                      (0x0008U)
#define PWM_EPWM_ETINTPS_RESERVED_1_RESETVAL                                   (0x0000U)
#define PWM_EPWM_ETINTPS_RESERVED_1_MAX                                        (0x00FFU)

#define PWM_EPWM_ETINTPS_RESETVAL                                              (0x0000U)

/* RESERVED_39 */

#define PWM_EPWM_RESERVED_39_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_39_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_39_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_39_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_39_RESETVAL                                          (0x0000U)

/* ETSOCPS */

#define PWM_EPWM_ETSOCPS_SOCAPRD2_MASK                                         (0x000FU)
#define PWM_EPWM_ETSOCPS_SOCAPRD2_SHIFT                                        (0x0000U)
#define PWM_EPWM_ETSOCPS_SOCAPRD2_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETSOCPS_SOCAPRD2_MAX                                          (0x000FU)

#define PWM_EPWM_ETSOCPS_SOCACNT2_MASK                                         (0x00F0U)
#define PWM_EPWM_ETSOCPS_SOCACNT2_SHIFT                                        (0x0004U)
#define PWM_EPWM_ETSOCPS_SOCACNT2_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETSOCPS_SOCACNT2_MAX                                          (0x000FU)

#define PWM_EPWM_ETSOCPS_SOCBPRD2_MASK                                         (0x0F00U)
#define PWM_EPWM_ETSOCPS_SOCBPRD2_SHIFT                                        (0x0008U)
#define PWM_EPWM_ETSOCPS_SOCBPRD2_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETSOCPS_SOCBPRD2_MAX                                          (0x000FU)

#define PWM_EPWM_ETSOCPS_SOCBCNT2_MASK                                         (0xF000U)
#define PWM_EPWM_ETSOCPS_SOCBCNT2_SHIFT                                        (0x000CU)
#define PWM_EPWM_ETSOCPS_SOCBCNT2_RESETVAL                                     (0x0000U)
#define PWM_EPWM_ETSOCPS_SOCBCNT2_MAX                                          (0x000FU)

#define PWM_EPWM_ETSOCPS_RESETVAL                                              (0x0000U)

/* RESERVED_40 */

#define PWM_EPWM_RESERVED_40_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_40_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_40_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_40_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_40_RESETVAL                                          (0x0000U)

/* ETCNTINITCTL */

