TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_ETSOCAMIXEN_RESERVED_1_MASK                                   (0xF800U)
#define PWM_EPWM_ETSOCAMIXEN_RESERVED_1_SHIFT                                  (0x000BU)
#define PWM_EPWM_ETSOCAMIXEN_RESERVED_1_RESETVAL                               (0x0000U)
#define PWM_EPWM_ETSOCAMIXEN_RESERVED_1_MAX                                    (0x001FU)

#define PWM_EPWM_ETSOCAMIXEN_RESETVAL                                          (0x0003U)

/* RESERVED_44 */

#define PWM_EPWM_RESERVED_44_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_44_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_44_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_44_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_44_RESETVAL                                          (0x0000U)

/* ETSOCBMIXEN */

#define PWM_EPWM_ETSOCBMIXEN_ZRO_MASK                                          (0x0001U)
#define PWM_EPWM_ETSOCBMIXEN_ZRO_SHIFT                                         (0x0000U)
#define PWM_EPWM_ETSOCBMIXEN_ZRO_RESETVAL                                      (0x0001U)
#define PWM_EPWM_ETSOCBMIXEN_ZRO_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCBMIXEN_PRD_MASK                                          (0x0002U)
#define PWM_EPWM_ETSOCBMIXEN_PRD_SHIFT                                         (0x0001U)
#define PWM_EPWM_ETSOCBMIXEN_PRD_RESETVAL                                      (0x0001U)
#define PWM_EPWM_ETSOCBMIXEN_PRD_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCBMIXEN_CAU_MASK                                          (0x0004U)
#define PWM_EPWM_ETSOCBMIXEN_CAU_SHIFT                                         (0x0002U)
#define PWM_EPWM_ETSOCBMIXEN_CAU_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCBMIXEN_CAU_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCBMIXEN_CAD_MASK                                          (0x0008U)
#define PWM_EPWM_ETSOCBMIXEN_CAD_SHIFT                                         (0x0003U)
#define PWM_EPWM_ETSOCBMIXEN_CAD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCBMIXEN_CAD_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCBMIXEN_CBU_MASK                                          (0x0010U)
#define PWM_EPWM_ETSOCBMIXEN_CBU_SHIFT                                         (0x0004U)
#define PWM_EPWM_ETSOCBMIXEN_CBU_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCBMIXEN_CBU_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCBMIXEN_CBD_MASK                                          (0x0020U)
#define PWM_EPWM_ETSOCBMIXEN_CBD_SHIFT                                         (0x0005U)
#define PWM_EPWM_ETSOCBMIXEN_CBD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCBMIXEN_CBD_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCBMIXEN_CCU_MASK                                          (0x0040U)
#define PWM_EPWM_ETSOCBMIXEN_CCU_SHIFT                                         (0x0006U)
#define PWM_EPWM_ETSOCBMIXEN_CCU_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCBMIXEN_CCU_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCBMIXEN_CCD_MASK                                          (0x0080U)
#define PWM_EPWM_ETSOCBMIXEN_CCD_SHIFT                                         (0x0007U)
#define PWM_EPWM_ETSOCBMIXEN_CCD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCBMIXEN_CCD_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCBMIXEN_CDU_MASK                                          (0x0100U)
#define PWM_EPWM_ETSOCBMIXEN_CDU_SHIFT                                         (0x0008U)
#define PWM_EPWM_ETSOCBMIXEN_CDU_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCBMIXEN_CDU_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCBMIXEN_CDD_MASK                                          (0x0200U)
#define PWM_EPWM_ETSOCBMIXEN_CDD_SHIFT                                         (0x0009U)
#define PWM_EPWM_ETSOCBMIXEN_CDD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_ETSOCBMIXEN_CDD_MAX                                           (0x0001U)

#define PWM_EPWM_ETSOCBMIXEN_DCBEVT1_MASK                                      (0x0400U)
#define PWM_EPWM_ETSOCBMIXEN_DCBEVT1_SHIFT                                     (0x000AU)
#define PWM_EPWM_ETSOCBMIXEN_DCBEVT1_RESETVAL                                  (0x0000U)
#define PWM_EPWM_ETSOCBMIXEN_DCBEVT1_MAX                                       (0x0001U)

#define PWM_EPWM_ETSOCBMIXEN_RESERVED_1_MASK                                   (0xF800U)
#define PWM_EPWM_ETSOCBMIXEN_RESERVED_1_SHIFT                                  (0x000BU)
#define PWM_EPWM_ETSOCBMIXEN_RESERVED_1_RESETVAL                               (0x0000U)
#define PWM_EPWM_ETSOCBMIXEN_RESERVED_1_MAX                                    (0x001FU)

#define PWM_EPWM_ETSOCBMIXEN_RESETVAL                                          (0x0003U)

/* RESERVED_45 */

#define PWM_EPWM_RESERVED_45_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_45_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_45_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_45_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_45_RESETVAL                                          (0x0000U)

/* DCTRIPSEL */

#define PWM_EPWM_DCTRIPSEL_DCAHCOMPSEL_MASK                                    (0x000FU)
#define PWM_EPWM_DCTRIPSEL_DCAHCOMPSEL_SHIFT                                   (0x0000U)
#define PWM_EPWM_DCTRIPSEL_DCAHCOMPSEL_RESETVAL                                (0x0000U)
#define PWM_EPWM_DCTRIPSEL_DCAHCOMPSEL_MAX                                     (0x000FU)

#define PWM_EPWM_DCTRIPSEL_DCALCOMPSEL_MASK                                    (0x00F0U)
#define PWM_EPWM_DCTRIPSEL_DCALCOMPSEL_SHIFT                                   (0x0004U)
#define PWM_EPWM_DCTRIPSEL_DCALCOMPSEL_RESETVAL                                (0x0000U)
#define PWM_EPWM_DCTRIPSEL_DCALCOMPSEL_MAX                                     (0x000FU)

#define PWM_EPWM_DCTRIPSEL_DCBHCOMPSEL_MASK                                    (0x0F00U)
#define PWM_EPWM_DCTRIPSEL_DCBHCOMPSEL_SHIFT                                   (0x0008U)
#define PWM_EPWM_DCTRIPSEL_DCBHCOMPSEL_RESETVAL                                (0x0000U)
#define PWM_EPWM_DCTRIPSEL_DCBHCOMPSEL_MAX                                     (0x000FU)

#define PWM_EPWM_DCTRIPSEL_DCBLCOMPSEL_MASK                                    (0xF000U)
#define PWM_EPWM_DCTRIPSEL_DCBLCOMPSEL_SHIFT                                   (0x000CU)
#define PWM_EPWM_DCTRIPSEL_DCBLCOMPSEL_RESETVAL                                (0x0000U)
#define PWM_EPWM_DCTRIPSEL_DCBLCOMPSEL_MAX                                     (0x000FU)

#define PWM_EPWM_DCTRIPSEL_RESETVAL                                            (0x0000U)

/* RESERVED_46 */

#define PWM_EPWM_RESERVED_46_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_46_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_46_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_46_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_46_RESETVAL                                          (0x0000U)

