TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_DCCAPMIXSEL_PRD_MASK                                          (0x0002U)
#define PWM_EPWM_DCCAPMIXSEL_PRD_SHIFT                                         (0x0001U)
#define PWM_EPWM_DCCAPMIXSEL_PRD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_PRD_MAX                                           (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CAU_MASK                                          (0x0004U)
#define PWM_EPWM_DCCAPMIXSEL_CAU_SHIFT                                         (0x0002U)
#define PWM_EPWM_DCCAPMIXSEL_CAU_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CAU_MAX                                           (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CAD_MASK                                          (0x0008U)
#define PWM_EPWM_DCCAPMIXSEL_CAD_SHIFT                                         (0x0003U)
#define PWM_EPWM_DCCAPMIXSEL_CAD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CAD_MAX                                           (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CBU_MASK                                          (0x0010U)
#define PWM_EPWM_DCCAPMIXSEL_CBU_SHIFT                                         (0x0004U)
#define PWM_EPWM_DCCAPMIXSEL_CBU_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CBU_MAX                                           (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CBD_MASK                                          (0x0020U)
#define PWM_EPWM_DCCAPMIXSEL_CBD_SHIFT                                         (0x0005U)
#define PWM_EPWM_DCCAPMIXSEL_CBD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CBD_MAX                                           (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CCU_MASK                                          (0x0040U)
#define PWM_EPWM_DCCAPMIXSEL_CCU_SHIFT                                         (0x0006U)
#define PWM_EPWM_DCCAPMIXSEL_CCU_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CCU_MAX                                           (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CCD_MASK                                          (0x0080U)
#define PWM_EPWM_DCCAPMIXSEL_CCD_SHIFT                                         (0x0007U)
#define PWM_EPWM_DCCAPMIXSEL_CCD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CCD_MAX                                           (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CDU_MASK                                          (0x0100U)
#define PWM_EPWM_DCCAPMIXSEL_CDU_SHIFT                                         (0x0008U)
#define PWM_EPWM_DCCAPMIXSEL_CDU_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CDU_MAX                                           (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_CDD_MASK                                          (0x0200U)
#define PWM_EPWM_DCCAPMIXSEL_CDD_SHIFT                                         (0x0009U)
#define PWM_EPWM_DCCAPMIXSEL_CDD_RESETVAL                                      (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_CDD_MAX                                           (0x0001U)

#define PWM_EPWM_DCCAPMIXSEL_RESERVED_1_MASK                                   (0xFC00U)
#define PWM_EPWM_DCCAPMIXSEL_RESERVED_1_SHIFT                                  (0x000AU)
#define PWM_EPWM_DCCAPMIXSEL_RESERVED_1_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCCAPMIXSEL_RESERVED_1_MAX                                    (0x003FU)

#define PWM_EPWM_DCCAPMIXSEL_RESETVAL                                          (0x0000U)

/* DCCAP */

#define PWM_EPWM_DCCAP_DCCAP_MASK                                              (0xFFFFU)
#define PWM_EPWM_DCCAP_DCCAP_SHIFT                                             (0x0000U)
#define PWM_EPWM_DCCAP_DCCAP_RESETVAL                                          (0x0000U)
#define PWM_EPWM_DCCAP_DCCAP_MAX                                               (0xFFFFU)

#define PWM_EPWM_DCCAP_RESETVAL                                                (0x0000U)

/* RESERVED_48 */

#define PWM_EPWM_RESERVED_48_UNNAMED_MASK                                      (0x0001U)
#define PWM_EPWM_RESERVED_48_UNNAMED_SHIFT                                     (0x0000U)
#define PWM_EPWM_RESERVED_48_UNNAMED_RESETVAL                                  (0x0000U)
#define PWM_EPWM_RESERVED_48_UNNAMED_MAX                                       (0x0001U)

#define PWM_EPWM_RESERVED_48_RESETVAL                                          (0x0000U)

/* DCAHTRIPSEL */

#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT1_MASK                                   (0x0001U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT1_SHIFT                                  (0x0000U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT1_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT1_MAX                                    (0x0001U)

#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT2_MASK                                   (0x0002U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT2_SHIFT                                  (0x0001U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT2_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT2_MAX                                    (0x0001U)

#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT3_MASK                                   (0x0004U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT3_SHIFT                                  (0x0002U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT3_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT3_MAX                                    (0x0001U)

#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT4_MASK                                   (0x0008U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT4_SHIFT                                  (0x0003U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT4_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT4_MAX                                    (0x0001U)

#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT5_MASK                                   (0x0010U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT5_SHIFT                                  (0x0004U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT5_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT5_MAX                                    (0x0001U)

#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT6_MASK                                   (0x0020U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT6_SHIFT                                  (0x0005U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT6_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCAHTRIPSEL_TRIPINPUT6_MAX                                    (0x0001U)

