TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT9_MASK                                   (0x0100U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT9_SHIFT                                  (0x0008U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT9_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT9_MAX                                    (0x0001U)

#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT10_MASK                                  (0x0200U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT10_SHIFT                                 (0x0009U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT10_RESETVAL                              (0x0000U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT10_MAX                                   (0x0001U)

#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT11_MASK                                  (0x0400U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT11_SHIFT                                 (0x000AU)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT11_RESETVAL                              (0x0000U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT11_MAX                                   (0x0001U)

#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT12_MASK                                  (0x0800U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT12_SHIFT                                 (0x000BU)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT12_RESETVAL                              (0x0000U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT12_MAX                                   (0x0001U)

#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT13_MASK                                  (0x1000U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT13_SHIFT                                 (0x000CU)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT13_RESETVAL                              (0x0000U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT13_MAX                                   (0x0001U)

#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT14_MASK                                  (0x2000U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT14_SHIFT                                 (0x000DU)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT14_RESETVAL                              (0x0000U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT14_MAX                                   (0x0001U)

#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT15_MASK                                  (0x4000U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT15_SHIFT                                 (0x000EU)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT15_RESETVAL                              (0x0000U)
#define PWM_EPWM_DCALTRIPSEL_TRIPINPUT15_MAX                                   (0x0001U)

#define PWM_EPWM_DCALTRIPSEL_RESERVED_1_MASK                                   (0x8000U)
#define PWM_EPWM_DCALTRIPSEL_RESERVED_1_SHIFT                                  (0x000FU)
#define PWM_EPWM_DCALTRIPSEL_RESERVED_1_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCALTRIPSEL_RESERVED_1_MAX                                    (0x0001U)

#define PWM_EPWM_DCALTRIPSEL_RESETVAL                                          (0x0000U)

/* DCBHTRIPSEL */

#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT1_MASK                                   (0x0001U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT1_SHIFT                                  (0x0000U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT1_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT1_MAX                                    (0x0001U)

#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT2_MASK                                   (0x0002U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT2_SHIFT                                  (0x0001U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT2_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT2_MAX                                    (0x0001U)

#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT3_MASK                                   (0x0004U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT3_SHIFT                                  (0x0002U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT3_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT3_MAX                                    (0x0001U)

#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT4_MASK                                   (0x0008U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT4_SHIFT                                  (0x0003U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT4_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT4_MAX                                    (0x0001U)

#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT5_MASK                                   (0x0010U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT5_SHIFT                                  (0x0004U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT5_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT5_MAX                                    (0x0001U)

#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT6_MASK                                   (0x0020U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT6_SHIFT                                  (0x0005U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT6_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT6_MAX                                    (0x0001U)

#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT7_MASK                                   (0x0040U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT7_SHIFT                                  (0x0006U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT7_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT7_MAX                                    (0x0001U)

#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT8_MASK                                   (0x0080U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT8_SHIFT                                  (0x0007U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT8_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT8_MAX                                    (0x0001U)

#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT9_MASK                                   (0x0100U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT9_SHIFT                                  (0x0008U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT9_RESETVAL                               (0x0000U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT9_MAX                                    (0x0001U)

#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT10_MASK                                  (0x0200U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT10_SHIFT                                 (0x0009U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT10_RESETVAL                              (0x0000U)
#define PWM_EPWM_DCBHTRIPSEL_TRIPINPUT10_MAX                                   (0x0001U)

