TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
/* RESERVED_55 */

#define PWM_EPWM_RESERVED_55_UNNAMED_MASK                                      (0x00000001U)
#define PWM_EPWM_RESERVED_55_UNNAMED_SHIFT                                     (0x00000000U)
#define PWM_EPWM_RESERVED_55_UNNAMED_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_RESERVED_55_UNNAMED_MAX                                       (0x00000001U)

#define PWM_EPWM_RESERVED_55_RESETVAL                                          (0x00000000U)

/* XLOAD */

#define PWM_EPWM_XLOAD_STARTLD_MASK                                            (0x00000001U)
#define PWM_EPWM_XLOAD_STARTLD_SHIFT                                           (0x00000000U)
#define PWM_EPWM_XLOAD_STARTLD_RESETVAL                                        (0x00000000U)
#define PWM_EPWM_XLOAD_STARTLD_MAX                                             (0x00000001U)

#define PWM_EPWM_XLOAD_FRCLD_MASK                                              (0x00000002U)
#define PWM_EPWM_XLOAD_FRCLD_SHIFT                                             (0x00000001U)
#define PWM_EPWM_XLOAD_FRCLD_RESETVAL                                          (0x00000000U)
#define PWM_EPWM_XLOAD_FRCLD_MAX                                               (0x00000001U)

#define PWM_EPWM_XLOAD_RESERVED_1_MASK                                         (0xFFFFFFFCU)
#define PWM_EPWM_XLOAD_RESERVED_1_SHIFT                                        (0x00000002U)
#define PWM_EPWM_XLOAD_RESERVED_1_RESETVAL                                     (0x00000000U)
#define PWM_EPWM_XLOAD_RESERVED_1_MAX                                          (0x3FFFFFFFU)

#define PWM_EPWM_XLOAD_RESETVAL                                                (0x00000000U)

/* EPWMXLINKXLOAD */

#define PWM_EPWM_EPWMXLINKXLOAD_XLOADLINK_MASK                                 (0x0000001FU)
#define PWM_EPWM_EPWMXLINKXLOAD_XLOADLINK_SHIFT                                (0x00000000U)
#define PWM_EPWM_EPWMXLINKXLOAD_XLOADLINK_RESETVAL                             (0x00000000U)
#define PWM_EPWM_EPWMXLINKXLOAD_XLOADLINK_MAX                                  (0x0000001FU)

#define PWM_EPWM_EPWMXLINKXLOAD_RESERVED_1_MASK                                (0xFFFFFFE0U)
#define PWM_EPWM_EPWMXLINKXLOAD_RESERVED_1_SHIFT                               (0x00000005U)
#define PWM_EPWM_EPWMXLINKXLOAD_RESERVED_1_RESETVAL                            (0x00000000U)
#define PWM_EPWM_EPWMXLINKXLOAD_RESERVED_1_MAX                                 (0x07FFFFFFU)

#define PWM_EPWM_EPWMXLINKXLOAD_RESETVAL                                       (0x00000000U)

/* XREGSHDW1STS */

#define PWM_EPWM_XREGSHDW1STS_XCMP1_SHDW1FULL_MASK                             (0x00000001U)
#define PWM_EPWM_XREGSHDW1STS_XCMP1_SHDW1FULL_SHIFT                            (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP1_SHDW1FULL_RESETVAL                         (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP1_SHDW1FULL_MAX                              (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP2_SHDW1FULL_MASK                             (0x00000002U)
#define PWM_EPWM_XREGSHDW1STS_XCMP2_SHDW1FULL_SHIFT                            (0x00000001U)
#define PWM_EPWM_XREGSHDW1STS_XCMP2_SHDW1FULL_RESETVAL                         (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP2_SHDW1FULL_MAX                              (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP3_SHDW1FULL_MASK                             (0x00000004U)
#define PWM_EPWM_XREGSHDW1STS_XCMP3_SHDW1FULL_SHIFT                            (0x00000002U)
#define PWM_EPWM_XREGSHDW1STS_XCMP3_SHDW1FULL_RESETVAL                         (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP3_SHDW1FULL_MAX                              (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP4_SHDW1FULL_MASK                             (0x00000008U)
#define PWM_EPWM_XREGSHDW1STS_XCMP4_SHDW1FULL_SHIFT                            (0x00000003U)
#define PWM_EPWM_XREGSHDW1STS_XCMP4_SHDW1FULL_RESETVAL                         (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP4_SHDW1FULL_MAX                              (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP5_SHDW1FULL_MASK                             (0x00000010U)
#define PWM_EPWM_XREGSHDW1STS_XCMP5_SHDW1FULL_SHIFT                            (0x00000004U)
#define PWM_EPWM_XREGSHDW1STS_XCMP5_SHDW1FULL_RESETVAL                         (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP5_SHDW1FULL_MAX                              (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP6_SHDW1FULL_MASK                             (0x00000020U)
#define PWM_EPWM_XREGSHDW1STS_XCMP6_SHDW1FULL_SHIFT                            (0x00000005U)
#define PWM_EPWM_XREGSHDW1STS_XCMP6_SHDW1FULL_RESETVAL                         (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP6_SHDW1FULL_MAX                              (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP7_SHDW1FULL_MASK                             (0x00000040U)
#define PWM_EPWM_XREGSHDW1STS_XCMP7_SHDW1FULL_SHIFT                            (0x00000006U)
#define PWM_EPWM_XREGSHDW1STS_XCMP7_SHDW1FULL_RESETVAL                         (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP7_SHDW1FULL_MAX                              (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XCMP8_SHDW1FULL_MASK                             (0x00000080U)
#define PWM_EPWM_XREGSHDW1STS_XCMP8_SHDW1FULL_SHIFT                            (0x00000007U)
#define PWM_EPWM_XREGSHDW1STS_XCMP8_SHDW1FULL_RESETVAL                         (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XCMP8_SHDW1FULL_MAX                              (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XTBPRD_SHDW1FULL_MASK                            (0x00000100U)
#define PWM_EPWM_XREGSHDW1STS_XTBPRD_SHDW1FULL_SHIFT                           (0x00000008U)
#define PWM_EPWM_XREGSHDW1STS_XTBPRD_SHDW1FULL_RESETVAL                        (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XTBPRD_SHDW1FULL_MAX                             (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_CMPC_SHDW1FULL_MASK                              (0x00000200U)
#define PWM_EPWM_XREGSHDW1STS_CMPC_SHDW1FULL_SHIFT                             (0x00000009U)
#define PWM_EPWM_XREGSHDW1STS_CMPC_SHDW1FULL_RESETVAL                          (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_CMPC_SHDW1FULL_MAX                               (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_CMPD_SHDW1FULL_MASK                              (0x00000400U)
#define PWM_EPWM_XREGSHDW1STS_CMPD_SHDW1FULL_SHIFT                             (0x0000000AU)
#define PWM_EPWM_XREGSHDW1STS_CMPD_SHDW1FULL_RESETVAL                          (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_CMPD_SHDW1FULL_MAX                               (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XAQCTLA_SHDW1FULL_MASK                           (0x00000800U)
#define PWM_EPWM_XREGSHDW1STS_XAQCTLA_SHDW1FULL_SHIFT                          (0x0000000BU)
#define PWM_EPWM_XREGSHDW1STS_XAQCTLA_SHDW1FULL_RESETVAL                       (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XAQCTLA_SHDW1FULL_MAX                            (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XAQCTLB_SHDW1FULL_MASK                           (0x00001000U)
#define PWM_EPWM_XREGSHDW1STS_XAQCTLB_SHDW1FULL_SHIFT                          (0x0000000CU)
#define PWM_EPWM_XREGSHDW1STS_XAQCTLB_SHDW1FULL_RESETVAL                       (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XAQCTLB_SHDW1FULL_MAX                            (0x00000001U)

#define PWM_EPWM_XREGSHDW1STS_XMAX_SHDW1FULL_MASK                              (0x00002000U)
#define PWM_EPWM_XREGSHDW1STS_XMAX_SHDW1FULL_SHIFT                             (0x0000000DU)
#define PWM_EPWM_XREGSHDW1STS_XMAX_SHDW1FULL_RESETVAL                          (0x00000000U)
#define PWM_EPWM_XREGSHDW1STS_XMAX_SHDW1FULL_MAX                               (0x00000001U)

