TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_XREGSHDW3STS_XAQCTLB_SHDW3FULL_MASK                           (0x00001000U)
#define PWM_EPWM_XREGSHDW3STS_XAQCTLB_SHDW3FULL_SHIFT                          (0x0000000CU)
#define PWM_EPWM_XREGSHDW3STS_XAQCTLB_SHDW3FULL_RESETVAL                       (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XAQCTLB_SHDW3FULL_MAX                            (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XMAX_SHDW3FULL_MASK                              (0x00002000U)
#define PWM_EPWM_XREGSHDW3STS_XMAX_SHDW3FULL_SHIFT                             (0x0000000DU)
#define PWM_EPWM_XREGSHDW3STS_XMAX_SHDW3FULL_RESETVAL                          (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XMAX_SHDW3FULL_MAX                               (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_XMIN_SHDW3FULL_MASK                              (0x00004000U)
#define PWM_EPWM_XREGSHDW3STS_XMIN_SHDW3FULL_SHIFT                             (0x0000000EU)
#define PWM_EPWM_XREGSHDW3STS_XMIN_SHDW3FULL_RESETVAL                          (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_XMIN_SHDW3FULL_MAX                               (0x00000001U)

#define PWM_EPWM_XREGSHDW3STS_RESERVED_1_MASK                                  (0xFFFF8000U)
#define PWM_EPWM_XREGSHDW3STS_RESERVED_1_SHIFT                                 (0x0000000FU)
#define PWM_EPWM_XREGSHDW3STS_RESERVED_1_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XREGSHDW3STS_RESERVED_1_MAX                                   (0x0001FFFFU)

#define PWM_EPWM_XREGSHDW3STS_RESETVAL                                         (0x00000000U)

/* RESERVED_58 */

#define PWM_EPWM_RESERVED_58_UNNAMED_MASK                                      (0x00000001U)
#define PWM_EPWM_RESERVED_58_UNNAMED_SHIFT                                     (0x00000000U)
#define PWM_EPWM_RESERVED_58_UNNAMED_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_RESERVED_58_UNNAMED_MAX                                       (0x00000001U)

#define PWM_EPWM_RESERVED_58_RESETVAL                                          (0x00000000U)

/* XCMP1_ACTIVE */

#define PWM_EPWM_XCMP1_ACTIVE_XCMP1HR_ACTIVE_MASK                              (0x0000FFFFU)
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1HR_ACTIVE_SHIFT                             (0x00000000U)
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1HR_ACTIVE_RESETVAL                          (0x00000000U)
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1HR_ACTIVE_MAX                               (0x0000FFFFU)

#define PWM_EPWM_XCMP1_ACTIVE_XCMP1_ACTIVE_MASK                                (0xFFFF0000U)
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1_ACTIVE_SHIFT                               (0x00000010U)
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1_ACTIVE_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP1_ACTIVE_XCMP1_ACTIVE_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP1_ACTIVE_RESETVAL                                         (0x00000000U)

/* XCMP2_ACTIVE */

#define PWM_EPWM_XCMP2_ACTIVE_XCMP2HR_ACTIVE_MASK                              (0x0000FFFFU)
#define PWM_EPWM_XCMP2_ACTIVE_XCMP2HR_ACTIVE_SHIFT                             (0x00000000U)
#define PWM_EPWM_XCMP2_ACTIVE_XCMP2HR_ACTIVE_RESETVAL                          (0x00000000U)
#define PWM_EPWM_XCMP2_ACTIVE_XCMP2HR_ACTIVE_MAX                               (0x0000FFFFU)

#define PWM_EPWM_XCMP2_ACTIVE_XCMP2_ACTIVE_MASK                                (0xFFFF0000U)
#define PWM_EPWM_XCMP2_ACTIVE_XCMP2_ACTIVE_SHIFT                               (0x00000010U)
#define PWM_EPWM_XCMP2_ACTIVE_XCMP2_ACTIVE_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP2_ACTIVE_XCMP2_ACTIVE_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP2_ACTIVE_RESETVAL                                         (0x00000000U)

/* XCMP3_ACTIVE */

#define PWM_EPWM_XCMP3_ACTIVE_XCMP3HR_ACTIVE_MASK                              (0x0000FFFFU)
#define PWM_EPWM_XCMP3_ACTIVE_XCMP3HR_ACTIVE_SHIFT                             (0x00000000U)
#define PWM_EPWM_XCMP3_ACTIVE_XCMP3HR_ACTIVE_RESETVAL                          (0x00000000U)
#define PWM_EPWM_XCMP3_ACTIVE_XCMP3HR_ACTIVE_MAX                               (0x0000FFFFU)

#define PWM_EPWM_XCMP3_ACTIVE_XCMP3_ACTIVE_MASK                                (0xFFFF0000U)
#define PWM_EPWM_XCMP3_ACTIVE_XCMP3_ACTIVE_SHIFT                               (0x00000010U)
#define PWM_EPWM_XCMP3_ACTIVE_XCMP3_ACTIVE_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP3_ACTIVE_XCMP3_ACTIVE_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP3_ACTIVE_RESETVAL                                         (0x00000000U)

/* XCMP4_ACTIVE */

#define PWM_EPWM_XCMP4_ACTIVE_XCMP4HR_ACTIVE_MASK                              (0x0000FFFFU)
#define PWM_EPWM_XCMP4_ACTIVE_XCMP4HR_ACTIVE_SHIFT                             (0x00000000U)
#define PWM_EPWM_XCMP4_ACTIVE_XCMP4HR_ACTIVE_RESETVAL                          (0x00000000U)
#define PWM_EPWM_XCMP4_ACTIVE_XCMP4HR_ACTIVE_MAX                               (0x0000FFFFU)

#define PWM_EPWM_XCMP4_ACTIVE_XCMP4_ACTIVE_MASK                                (0xFFFF0000U)
#define PWM_EPWM_XCMP4_ACTIVE_XCMP4_ACTIVE_SHIFT                               (0x00000010U)
#define PWM_EPWM_XCMP4_ACTIVE_XCMP4_ACTIVE_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP4_ACTIVE_XCMP4_ACTIVE_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP4_ACTIVE_RESETVAL                                         (0x00000000U)

/* XCMP5_ACTIVE */

#define PWM_EPWM_XCMP5_ACTIVE_XCMP5HR_ACTIVE_MASK                              (0x0000FFFFU)
#define PWM_EPWM_XCMP5_ACTIVE_XCMP5HR_ACTIVE_SHIFT                             (0x00000000U)
#define PWM_EPWM_XCMP5_ACTIVE_XCMP5HR_ACTIVE_RESETVAL                          (0x00000000U)
#define PWM_EPWM_XCMP5_ACTIVE_XCMP5HR_ACTIVE_MAX                               (0x0000FFFFU)

#define PWM_EPWM_XCMP5_ACTIVE_XCMP5_ACTIVE_MASK                                (0xFFFF0000U)
#define PWM_EPWM_XCMP5_ACTIVE_XCMP5_ACTIVE_SHIFT                               (0x00000010U)
#define PWM_EPWM_XCMP5_ACTIVE_XCMP5_ACTIVE_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP5_ACTIVE_XCMP5_ACTIVE_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP5_ACTIVE_RESETVAL                                         (0x00000000U)

