TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_XCMP2_SHDW2_XCMP2HR_SHDW2_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP2_SHDW2_XCMP2HR_SHDW2_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW2_XCMP2HR_SHDW2_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW2_XCMP2HR_SHDW2_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP2_SHDW2_XCMP2_SHDW2_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP2_SHDW2_XCMP2_SHDW2_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP2_SHDW2_XCMP2_SHDW2_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW2_XCMP2_SHDW2_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP2_SHDW2_RESETVAL                                          (0x00000000U)

/* XCMP3_SHDW2 */

#define PWM_EPWM_XCMP3_SHDW2_XCMP3HR_SHDW2_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP3_SHDW2_XCMP3HR_SHDW2_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW2_XCMP3HR_SHDW2_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW2_XCMP3HR_SHDW2_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP3_SHDW2_XCMP3_SHDW2_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP3_SHDW2_XCMP3_SHDW2_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP3_SHDW2_XCMP3_SHDW2_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW2_XCMP3_SHDW2_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP3_SHDW2_RESETVAL                                          (0x00000000U)

/* XCMP4_SHDW2 */

#define PWM_EPWM_XCMP4_SHDW2_XCMP4HR_SHDW2_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP4_SHDW2_XCMP4HR_SHDW2_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW2_XCMP4HR_SHDW2_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW2_XCMP4HR_SHDW2_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP4_SHDW2_XCMP4_SHDW2_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP4_SHDW2_XCMP4_SHDW2_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP4_SHDW2_XCMP4_SHDW2_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW2_XCMP4_SHDW2_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP4_SHDW2_RESETVAL                                          (0x00000000U)

/* XCMP5_SHDW2 */

#define PWM_EPWM_XCMP5_SHDW2_XCMP5HR_SHDW2_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP5_SHDW2_XCMP5HR_SHDW2_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW2_XCMP5HR_SHDW2_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW2_XCMP5HR_SHDW2_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP5_SHDW2_XCMP5_SHDW2_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP5_SHDW2_XCMP5_SHDW2_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP5_SHDW2_XCMP5_SHDW2_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW2_XCMP5_SHDW2_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP5_SHDW2_RESETVAL                                          (0x00000000U)

/* XCMP6_SHDW2 */

#define PWM_EPWM_XCMP6_SHDW2_XCMP6HR_SHDW2_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP6_SHDW2_XCMP6HR_SHDW2_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP6_SHDW2_XCMP6HR_SHDW2_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP6_SHDW2_XCMP6HR_SHDW2_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP6_SHDW2_XCMP6_SHDW2_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP6_SHDW2_XCMP6_SHDW2_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP6_SHDW2_XCMP6_SHDW2_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP6_SHDW2_XCMP6_SHDW2_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP6_SHDW2_RESETVAL                                          (0x00000000U)

/* XCMP7_SHDW2 */

#define PWM_EPWM_XCMP7_SHDW2_XCMP7HR_SHDW2_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP7_SHDW2_XCMP7HR_SHDW2_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP7_SHDW2_XCMP7HR_SHDW2_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP7_SHDW2_XCMP7HR_SHDW2_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP7_SHDW2_XCMP7_SHDW2_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP7_SHDW2_XCMP7_SHDW2_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP7_SHDW2_XCMP7_SHDW2_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP7_SHDW2_XCMP7_SHDW2_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP7_SHDW2_RESETVAL                                          (0x00000000U)

/* XCMP8_SHDW2 */

#define PWM_EPWM_XCMP8_SHDW2_XCMP8HR_SHDW2_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP8_SHDW2_XCMP8HR_SHDW2_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP8_SHDW2_XCMP8HR_SHDW2_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP8_SHDW2_XCMP8HR_SHDW2_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP8_SHDW2_XCMP8_SHDW2_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP8_SHDW2_XCMP8_SHDW2_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP8_SHDW2_XCMP8_SHDW2_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP8_SHDW2_XCMP8_SHDW2_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP8_SHDW2_RESETVAL                                          (0x00000000U)

/* XTBPRD_SHDW2 */

#define PWM_EPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_MASK                              (0x0000FFFFU)
#define PWM_EPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_SHIFT                             (0x00000000U)
#define PWM_EPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_RESETVAL                          (0x00000000U)
#define PWM_EPWM_XTBPRD_SHDW2_XTBPRDHR_SHDW2_MAX                               (0x0000FFFFU)

#define PWM_EPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_MASK                                (0xFFFF0000U)
#define PWM_EPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_SHIFT                               (0x00000010U)
#define PWM_EPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XTBPRD_SHDW2_XTBPRD_SHDW2_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XTBPRD_SHDW2_RESETVAL                                         (0x00000000U)

/* RESERVED_67 */

#define PWM_EPWM_RESERVED_67_UNNAMED_MASK                                      (0x00000001U)
#define PWM_EPWM_RESERVED_67_UNNAMED_SHIFT                                     (0x00000000U)
#define PWM_EPWM_RESERVED_67_UNNAMED_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_RESERVED_67_UNNAMED_MAX                                       (0x00000001U)

