TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_RESERVED_71_UNNAMED_MASK                                      (0x00000001U)
#define PWM_EPWM_RESERVED_71_UNNAMED_SHIFT                                     (0x00000000U)
#define PWM_EPWM_RESERVED_71_UNNAMED_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_RESERVED_71_UNNAMED_MAX                                       (0x00000001U)

#define PWM_EPWM_RESERVED_71_RESETVAL                                          (0x00000000U)

/* XCMP1_SHDW3 */

#define PWM_EPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW3_XCMP1HR_SHDW3_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP1_SHDW3_XCMP1_SHDW3_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP1_SHDW3_XCMP1_SHDW3_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP1_SHDW3_XCMP1_SHDW3_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP1_SHDW3_XCMP1_SHDW3_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP1_SHDW3_RESETVAL                                          (0x00000000U)

/* XCMP2_SHDW3 */

#define PWM_EPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW3_XCMP2HR_SHDW3_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP2_SHDW3_XCMP2_SHDW3_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP2_SHDW3_XCMP2_SHDW3_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP2_SHDW3_XCMP2_SHDW3_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP2_SHDW3_XCMP2_SHDW3_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP2_SHDW3_RESETVAL                                          (0x00000000U)

/* XCMP3_SHDW3 */

#define PWM_EPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW3_XCMP3HR_SHDW3_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP3_SHDW3_XCMP3_SHDW3_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP3_SHDW3_XCMP3_SHDW3_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP3_SHDW3_XCMP3_SHDW3_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP3_SHDW3_XCMP3_SHDW3_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP3_SHDW3_RESETVAL                                          (0x00000000U)

/* XCMP4_SHDW3 */

#define PWM_EPWM_XCMP4_SHDW3_XCMP4HR_SHDW3_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP4_SHDW3_XCMP4HR_SHDW3_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW3_XCMP4HR_SHDW3_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW3_XCMP4HR_SHDW3_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP4_SHDW3_XCMP4_SHDW3_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP4_SHDW3_XCMP4_SHDW3_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP4_SHDW3_XCMP4_SHDW3_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP4_SHDW3_XCMP4_SHDW3_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP4_SHDW3_RESETVAL                                          (0x00000000U)

/* XCMP5_SHDW3 */

#define PWM_EPWM_XCMP5_SHDW3_XCMP5HR_SHDW3_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP5_SHDW3_XCMP5HR_SHDW3_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW3_XCMP5HR_SHDW3_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW3_XCMP5HR_SHDW3_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP5_SHDW3_XCMP5_SHDW3_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP5_SHDW3_XCMP5_SHDW3_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP5_SHDW3_XCMP5_SHDW3_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP5_SHDW3_XCMP5_SHDW3_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP5_SHDW3_RESETVAL                                          (0x00000000U)

/* XCMP6_SHDW3 */

#define PWM_EPWM_XCMP6_SHDW3_XCMP6HR_SHDW3_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP6_SHDW3_XCMP6HR_SHDW3_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP6_SHDW3_XCMP6HR_SHDW3_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP6_SHDW3_XCMP6HR_SHDW3_MAX                                 (0x0000FFFFU)

#define PWM_EPWM_XCMP6_SHDW3_XCMP6_SHDW3_MASK                                  (0xFFFF0000U)
#define PWM_EPWM_XCMP6_SHDW3_XCMP6_SHDW3_SHIFT                                 (0x00000010U)
#define PWM_EPWM_XCMP6_SHDW3_XCMP6_SHDW3_RESETVAL                              (0x00000000U)
#define PWM_EPWM_XCMP6_SHDW3_XCMP6_SHDW3_MAX                                   (0x0000FFFFU)

#define PWM_EPWM_XCMP6_SHDW3_RESETVAL                                          (0x00000000U)

/* XCMP7_SHDW3 */

#define PWM_EPWM_XCMP7_SHDW3_XCMP7HR_SHDW3_MASK                                (0x0000FFFFU)
#define PWM_EPWM_XCMP7_SHDW3_XCMP7HR_SHDW3_SHIFT                               (0x00000000U)
#define PWM_EPWM_XCMP7_SHDW3_XCMP7HR_SHDW3_RESETVAL                            (0x00000000U)
#define PWM_EPWM_XCMP7_SHDW3_XCMP7HR_SHDW3_MAX                                 (0x0000FFFFU)

