TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define PWM_EPWM_MINDBCFG_SELA_MASK                                            (0x000000F0U)
#define PWM_EPWM_MINDBCFG_SELA_SHIFT                                           (0x00000004U)
#define PWM_EPWM_MINDBCFG_SELA_RESETVAL                                        (0x00000000U)
#define PWM_EPWM_MINDBCFG_SELA_MAX                                             (0x0000000FU)

#define PWM_EPWM_MINDBCFG_POLSELA_MASK                                         (0x00000100U)
#define PWM_EPWM_MINDBCFG_POLSELA_SHIFT                                        (0x00000008U)
#define PWM_EPWM_MINDBCFG_POLSELA_RESETVAL                                     (0x00000000U)
#define PWM_EPWM_MINDBCFG_POLSELA_MAX                                          (0x00000001U)

#define PWM_EPWM_MINDBCFG_RESERVED_2_MASK                                      (0x0000FE00U)
#define PWM_EPWM_MINDBCFG_RESERVED_2_SHIFT                                     (0x00000009U)
#define PWM_EPWM_MINDBCFG_RESERVED_2_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_MINDBCFG_RESERVED_2_MAX                                       (0x0000007FU)

#define PWM_EPWM_MINDBCFG_ENABLEB_MASK                                         (0x00010000U)
#define PWM_EPWM_MINDBCFG_ENABLEB_SHIFT                                        (0x00000010U)
#define PWM_EPWM_MINDBCFG_ENABLEB_RESETVAL                                     (0x00000000U)
#define PWM_EPWM_MINDBCFG_ENABLEB_MAX                                          (0x00000001U)

#define PWM_EPWM_MINDBCFG_RESERVED_3_MASK                                      (0x00020000U)
#define PWM_EPWM_MINDBCFG_RESERVED_3_SHIFT                                     (0x00000011U)
#define PWM_EPWM_MINDBCFG_RESERVED_3_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_MINDBCFG_RESERVED_3_MAX                                       (0x00000001U)

#define PWM_EPWM_MINDBCFG_INVERTB_MASK                                         (0x00040000U)
#define PWM_EPWM_MINDBCFG_INVERTB_SHIFT                                        (0x00000012U)
#define PWM_EPWM_MINDBCFG_INVERTB_RESETVAL                                     (0x00000000U)
#define PWM_EPWM_MINDBCFG_INVERTB_MAX                                          (0x00000001U)

#define PWM_EPWM_MINDBCFG_SELBLOCKB_MASK                                       (0x00080000U)
#define PWM_EPWM_MINDBCFG_SELBLOCKB_SHIFT                                      (0x00000013U)
#define PWM_EPWM_MINDBCFG_SELBLOCKB_RESETVAL                                   (0x00000000U)
#define PWM_EPWM_MINDBCFG_SELBLOCKB_MAX                                        (0x00000001U)

#define PWM_EPWM_MINDBCFG_SELB_MASK                                            (0x00F00000U)
#define PWM_EPWM_MINDBCFG_SELB_SHIFT                                           (0x00000014U)
#define PWM_EPWM_MINDBCFG_SELB_RESETVAL                                        (0x00000000U)
#define PWM_EPWM_MINDBCFG_SELB_MAX                                             (0x0000000FU)

#define PWM_EPWM_MINDBCFG_POLSELB_MASK                                         (0x01000000U)
#define PWM_EPWM_MINDBCFG_POLSELB_SHIFT                                        (0x00000018U)
#define PWM_EPWM_MINDBCFG_POLSELB_RESETVAL                                     (0x00000000U)
#define PWM_EPWM_MINDBCFG_POLSELB_MAX                                          (0x00000001U)

#define PWM_EPWM_MINDBCFG_RESERVED_4_MASK                                      (0xFE000000U)
#define PWM_EPWM_MINDBCFG_RESERVED_4_SHIFT                                     (0x00000019U)
#define PWM_EPWM_MINDBCFG_RESERVED_4_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_MINDBCFG_RESERVED_4_MAX                                       (0x0000007FU)

#define PWM_EPWM_MINDBCFG_RESETVAL                                             (0x00000000U)

/* MINDBDLY */

#define PWM_EPWM_MINDBDLY_DELAYA_MASK                                          (0x0000FFFFU)
#define PWM_EPWM_MINDBDLY_DELAYA_SHIFT                                         (0x00000000U)
#define PWM_EPWM_MINDBDLY_DELAYA_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_MINDBDLY_DELAYA_MAX                                           (0x0000FFFFU)

#define PWM_EPWM_MINDBDLY_DELAYB_MASK                                          (0xFFFF0000U)
#define PWM_EPWM_MINDBDLY_DELAYB_SHIFT                                         (0x00000010U)
#define PWM_EPWM_MINDBDLY_DELAYB_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_MINDBDLY_DELAYB_MAX                                           (0x0000FFFFU)

#define PWM_EPWM_MINDBDLY_RESETVAL                                             (0x00000000U)

/* RESERVED_79 */

#define PWM_EPWM_RESERVED_79_UNNAMED_MASK                                      (0x00000001U)
#define PWM_EPWM_RESERVED_79_UNNAMED_SHIFT                                     (0x00000000U)
#define PWM_EPWM_RESERVED_79_UNNAMED_RESETVAL                                  (0x00000000U)
#define PWM_EPWM_RESERVED_79_UNNAMED_MAX                                       (0x00000001U)

#define PWM_EPWM_RESERVED_79_RESETVAL                                          (0x00000000U)

/* LUTCTLA */

#define PWM_EPWM_LUTCTLA_BYPASS_MASK                                           (0x00000001U)
#define PWM_EPWM_LUTCTLA_BYPASS_SHIFT                                          (0x00000000U)
#define PWM_EPWM_LUTCTLA_BYPASS_RESETVAL                                       (0x00000001U)
#define PWM_EPWM_LUTCTLA_BYPASS_MAX                                            (0x00000001U)

#define PWM_EPWM_LUTCTLA_RESERVED_1_MASK                                       (0x0000000EU)
#define PWM_EPWM_LUTCTLA_RESERVED_1_SHIFT                                      (0x00000001U)
#define PWM_EPWM_LUTCTLA_RESERVED_1_RESETVAL                                   (0x00000000U)
#define PWM_EPWM_LUTCTLA_RESERVED_1_MAX                                        (0x00000007U)

#define PWM_EPWM_LUTCTLA_SELXBAR_MASK                                          (0x000000F0U)
#define PWM_EPWM_LUTCTLA_SELXBAR_SHIFT                                         (0x00000004U)
#define PWM_EPWM_LUTCTLA_SELXBAR_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLA_SELXBAR_MAX                                           (0x0000000FU)

#define PWM_EPWM_LUTCTLA_RESERVED_2_MASK                                       (0x0000FF00U)
#define PWM_EPWM_LUTCTLA_RESERVED_2_SHIFT                                      (0x00000008U)
#define PWM_EPWM_LUTCTLA_RESERVED_2_RESETVAL                                   (0x00000000U)
#define PWM_EPWM_LUTCTLA_RESERVED_2_MAX                                        (0x000000FFU)

#define PWM_EPWM_LUTCTLA_LUTDEC0_MASK                                          (0x00010000U)
#define PWM_EPWM_LUTCTLA_LUTDEC0_SHIFT                                         (0x00000010U)
#define PWM_EPWM_LUTCTLA_LUTDEC0_RESETVAL                                      (0x00000000U)
#define PWM_EPWM_LUTCTLA_LUTDEC0_MAX                                           (0x00000001U)

