TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define CSL_EPWM_AQCTLA_ZRO_SHIFT                                                       (0U)
#define CSL_EPWM_AQCTLA_ZRO_MASK                                                        (0x00000003U)
#define CSL_EPWM_AQCTLA_ZRO_CLEAR                                                       (1U)
#define CSL_EPWM_AQCTLA_ZRO_SET                                                         (2U)
#define CSL_EPWM_AQCTLA_ZRO_DISABLED                                                    (0U)
#define CSL_EPWM_AQCTLA_ZRO_TOGGLE                                                      (3U)

#define CSL_EPWM_AQCTLA_PRD_SHIFT                                                       (2U)
#define CSL_EPWM_AQCTLA_PRD_MASK                                                        (0x0000000cU)
#define CSL_EPWM_AQCTLA_PRD_CLEAR                                                       (1U)
#define CSL_EPWM_AQCTLA_PRD_SET                                                         (2U)
#define CSL_EPWM_AQCTLA_PRD_DISABLED                                                    (0U)
#define CSL_EPWM_AQCTLA_PRD_TOGGLE                                                      (3U)

#define CSL_EPWM_AQCTLA_CAU_SHIFT                                                       (4U)
#define CSL_EPWM_AQCTLA_CAU_MASK                                                        (0x00000030U)
#define CSL_EPWM_AQCTLA_CAU_DISABLED                                                    (0U)
#define CSL_EPWM_AQCTLA_CAU_CLEAR                                                       (1U)
#define CSL_EPWM_AQCTLA_CAU_SET                                                         (2U)
#define CSL_EPWM_AQCTLA_CAU_TOGGLE                                                      (3U)

#define CSL_EPWM_AQCTLA_CAD_SHIFT                                                       (6U)
#define CSL_EPWM_AQCTLA_CAD_MASK                                                        (0x000000c0U)
#define CSL_EPWM_AQCTLA_CAD_CLEAR                                                       (1U)
#define CSL_EPWM_AQCTLA_CAD_SET                                                         (2U)
#define CSL_EPWM_AQCTLA_CAD_DISABLED                                                    (0U)
#define CSL_EPWM_AQCTLA_CAD_TOGGLE                                                      (3U)

#define CSL_EPWM_AQCTLA_CBU_SHIFT                                                       (8U)
#define CSL_EPWM_AQCTLA_CBU_MASK                                                        (0x00000300U)
#define CSL_EPWM_AQCTLA_CBU_DISABLED                                                    (0U)
#define CSL_EPWM_AQCTLA_CBU_CLEAR                                                       (1U)
#define CSL_EPWM_AQCTLA_CBU_SET                                                         (2U)
#define CSL_EPWM_AQCTLA_CBU_TOGGLE                                                      (3U)

#define CSL_EPWM_AQCTLA_CBD_SHIFT                                                      (10U)
#define CSL_EPWM_AQCTLA_CBD_MASK                                                       (0x00000c00U)
#define CSL_EPWM_AQCTLA_CBD_CLEAR                                                      (1U)
#define CSL_EPWM_AQCTLA_CBD_SET                                                        (2U)
#define CSL_EPWM_AQCTLA_CBD_DISABLED                                                   (0U)
#define CSL_EPWM_AQCTLA_CBD_TOGGLE                                                     (3U)
																					   
#define CSL_EPWM_CMPCTL_LOADAMODE_SHIFT                                                (0U)
#define CSL_EPWM_CMPCTL_LOADAMODE_MASK												   (0x00000003U)
#define CSL_EPWM_CMPCTL_LOADAMODE_CTR_PRD                                              (1U)
#define CSL_EPWM_CMPCTL_LOADAMODE_CTR_0_OR_PRD                                         (2U)
#define CSL_EPWM_CMPCTL_LOADAMODE_CTR_0                                                (0U)
#define CSL_EPWM_CMPCTL_LOADAMODE_FREEZE                                               (3U)
																					
#define CSL_EPWM_CMPCTL_LOADBMODE_SHIFT                                               (2U)
#define CSL_EPWM_CMPCTL_LOADBMODE_MASK                                                (0x0000000cU)
#define CSL_EPWM_CMPCTL_LOADBMODE_CTR_PRD                                             (1U)
#define CSL_EPWM_CMPCTL_LOADBMODE_CTR_0_OR_PRD                                        (2U)
#define CSL_EPWM_CMPCTL_LOADBMODE_CTR_0                                               (0U)
#define CSL_EPWM_CMPCTL_LOADBMODE_FREEZE                                              (3U)
																					
#define CSL_EPWM_CMPCTL_SHDWAMODE_SHIFT                                               (4U)
#define CSL_EPWM_CMPCTL_SHDWAMODE_MASK                                                (0x00000010U)
#define CSL_EPWM_CMPCTL_SHDWAMODE_SHADOW                                              (0U)                                                                                                                                                                  
#define CSL_EPWM_CMPCTL_SHDWAMODE_IMMEDIATE                                           (1U)
																					
#define CSL_EPWM_CMPCTL_SHDWBMODE_SHIFT                                               (6U)
#define CSL_EPWM_CMPCTL_SHDWBMODE_MASK                                                (0x00000040U)
#define CSL_EPWM_CMPCTL_SHDWBMODE_SHADOW                                              (0U)
#define CSL_EPWM_CMPCTL_SHDWBMODE_IMMEDIATE                                           (1U)
																					
#define CSL_EPWM_CMPCTL_SHDWAFULL_SHIFT                                               (8U)
#define CSL_EPWM_CMPCTL_SHDWAFULL_MASK                                                (0x00000100U)
#define CSL_EPWM_CMPCTL_SHDWAFULL_FIFO_FULL                                           (1U)                                                                                                                                                                            
#define CSL_EPWM_CMPCTL_SHDWAFULL_FIFO_NOT_FULL                                       (0U)
																					
