TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define CSL_EPWM_CMPCTL_SHDWBFULL_SHIFT                                               (9U)
#define CSL_EPWM_CMPCTL_SHDWBFULL_MASK                                                (0x00000200U)
#define CSL_EPWM_CMPCTL_SHDWBFULL_FIFO_NOT_FULL                                       (0U)                                                                                                                                                                          
#define CSL_EPWM_CMPCTL_SHDWBFULL_FIFO_FULL                                           (1U)
                                                                                                                                                                    
#define CSL_EPWM_DBFED_DEL_SHIFT                                                      (0U)                                                                                                                                                                    
#define CSL_EPWM_DBFED_DEL_MASK                                                       (0x000003ffU)
																					
#define CSL_EPWM_PCCTL_CHPEN_SHIFT                                                    (0U)
#define CSL_EPWM_PCCTL_CHPEN_MASK                                                     (0x00000001U)
#define CSL_EPWM_PCCTL_CHPEN_DISABLE                                                  (0U)
#define CSL_EPWM_PCCTL_CHPEN_ENABLE                                                   (1U)
																					
#define CSL_EPWM_PCCTL_OSHTWTH_SHIFT                                                  (1U)
#define CSL_EPWM_PCCTL_OSHTWTH_MASK                                                   (0x0000001eU)
#define CSL_EPWM_PCCTL_OSHTWTH_2_X_SYSCLOCKOUT_BY_8_WIDE                              (1U)
#define CSL_EPWM_PCCTL_OSHTWTH_16_X_SYSCLOCKOUT_BY_8_WIDE                             (15U)
#define CSL_EPWM_PCCTL_OSHTWTH_1_X_SYSCLOCKOUT_BY_8_WIDE                              (0U)
#define CSL_EPWM_PCCTL_OSHTWTH_4_X_SYSCLOCKOUT_BY_8_WIDE                              (3U)
#define CSL_EPWM_PCCTL_OSHTWTH_3_X_SYSCLOCKOUT_BY_8_WIDE                              (2U)
																					
#define CSL_EPWM_PCCTL_CHPFREQ_SHIFT                                                  (5U)
                                                                                                                                                                           
#define CSL_EPWM_PCCTL_CHPFREQ_MASK                                                   (0x000000e0U)
#define CSL_EPWM_PCCTL_CHPFREQ_DIV_6                                                  (5U)                                                                                                                                                                   
#define CSL_EPWM_PCCTL_CHPFREQ_DIV_3                                                  (2U)
#define CSL_EPWM_PCCTL_CHPFREQ_DIV_2                                                  (1U)
#define CSL_EPWM_PCCTL_CHPFREQ_DIV_8                                                  (7U)
#define CSL_EPWM_PCCTL_CHPFREQ_DIV_4                                                  (3U)
#define CSL_EPWM_PCCTL_CHPFREQ_DIV_1                                                  (0U)
#define CSL_EPWM_PCCTL_CHPFREQ_DIV_7                                                  (6U)
#define CSL_EPWM_PCCTL_CHPFREQ_DIV_5                                                  (4U)
																					
#define CSL_EPWM_PCCTL_CHPDUTY_SHIFT                                                 (8U)
#define CSL_EPWM_PCCTL_CHPDUTY_MASK                                                  (0x00000700U)
#define CSL_EPWM_PCCTL_CHPDUTY_DUTY_87_5                                             (6U)                                                                                                                                                                           
#define CSL_EPWM_PCCTL_CHPDUTY_EN_0X7                                                (7U)
#define CSL_EPWM_PCCTL_CHPDUTY_DUTY_25                                               (1U)
#define CSL_EPWM_PCCTL_CHPDUTY_DUTY_75                                               (5U)
#define CSL_EPWM_PCCTL_CHPDUTY_DUTY_62_5                                             (4U)
#define CSL_EPWM_PCCTL_CHPDUTY_DUTY_50                                               (3U)
#define CSL_EPWM_PCCTL_CHPDUTY_DUTY_37_5                                             (2U)
#define CSL_EPWM_PCCTL_CHPDUTY_DUTY_12_5                                             (0U)
                                                                                                                                                                     
																					
#define CSL_EPWM_DBRED_DEL_SHIFT                                                     (0U)
#define CSL_EPWM_DBRED_DEL_MASK                                                      (0x000003ffU)
																					
#define CSL_EPWM_TBCTR_SHIFT                                                         (0U)
                                                                                                                                                                   
#define CSL_EPWM_TBCTR_MASK                                                          (0x0000ffffU)
																					
#define CSL_EPWM_ETSEL_INTSEL_SHIFT                                                  (0U)
#define CSL_EPWM_ETSEL_INTSEL_MASK                                                   (0x00000007U)
#define CSL_EPWM_ETSEL_INTSEL_CTR_CMPB_INCR                                          (6U)
#define CSL_EPWM_ETSEL_INTSEL_CTR_CMPA_DECR                                          (5U)
#define CSL_EPWM_ETSEL_INTSEL_CTR_0                                                  (1U)
#define CSL_EPWM_ETSEL_INTSEL_CTR_PERIOD                                             (2U)
#define CSL_EPWM_ETSEL_INTSEL_CTR_CMPA_INCR                                          (4U)
#define CSL_EPWM_ETSEL_INTSEL_CTR_CMPB_DECR                                          (7U)
																					
#define CSL_EPWM_ETSEL_INTEN_SHIFT                                                   (3U)
#define CSL_EPWM_ETSEL_INTEN_MASK                                                    (0x00000008U)
#define CSL_EPWM_ETSEL_INTEN_DISABLE                                                 (0U)
#define CSL_EPWM_ETSEL_INTEN_ENABLE                                                  (1U)
																					
#define CSL_EPWM_TZEINT_CBC_SHIFT                                                    (1U)
#define CSL_EPWM_TZEINT_CBC_MASK                                                     (0x00000002U)
#define CSL_EPWM_TZEINT_CBC_DISABLE                                                   (0U)
#define CSL_EPWM_TZEINT_CBC_ENABLE                                                    (1U)
																					
#define CSL_EPWM_TZEINT_OST_SHIFT                                                    (2U)
#define CSL_EPWM_TZEINT_OST_MASK                                                     (0x00000004U)
#define CSL_EPWM_TZEINT_OST_DISABLE                                                   (0U)
#define CSL_EPWM_TZEINT_OST_ENABLE                                                    (1U)
																					
#define CSL_EPWM_AQSFRC_ACTSFA_SHIFT                                                 (0U)
#define CSL_EPWM_AQSFRC_ACTSFA_MASK                                                  (0x00000003U)
#define CSL_EPWM_AQSFRC_ACTSFA_SET                                                   (2U)
#define CSL_EPWM_AQSFRC_ACTSFA_CLEAR                                                 (1U)
#define CSL_EPWM_AQSFRC_ACTSFA_DISABLED                                              (0U)
#define CSL_EPWM_AQSFRC_ACTSFA_TOGGLE                                                (3U)
																					
