TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define CSL_EPWM_AQCTLB_CAU_SHIFT                                                    (4U)
#define CSL_EPWM_AQCTLB_CAU_MASK                                                     (0x00000030U)
#define CSL_EPWM_AQCTLB_CAU_CLEAR                                                    (1U)
#define CSL_EPWM_AQCTLB_CAU_DISABLED                                                 (0U)
#define CSL_EPWM_AQCTLB_CAU_TOGGLE                                                   (3U)
#define CSL_EPWM_AQCTLB_CAU_SET                                                      (2U)
																					
#define CSL_EPWM_AQCTLB_CAD_SHIFT                                                    (6U)
#define CSL_EPWM_AQCTLB_CAD_MASK                                                     (0x000000c0U)
#define CSL_EPWM_AQCTLB_CAD_CLEAR                                                    (1U)
#define CSL_EPWM_AQCTLB_CAD_DISABLED                                                 (0U)
#define CSL_EPWM_AQCTLB_CAD_TOGGLE                                                   (3U)
#define CSL_EPWM_AQCTLB_CAD_SET                                                      (2U)
																					
#define CSL_EPWM_AQCTLB_CBU_SHIFT                                                    (8U)
#define CSL_EPWM_AQCTLB_CBU_MASK                                                     (0x00000300U)
#define CSL_EPWM_AQCTLB_CBU_TOGGLE                                                   (3U)
#define CSL_EPWM_AQCTLB_CBU_CLEAR                                                    (1U)
#define CSL_EPWM_AQCTLB_CBU_DISABLED                                                 (0U)
#define CSL_EPWM_AQCTLB_CBU_SET                                                      (2U)
																					
#define CSL_EPWM_AQCTLB_CBD_SHIFT                                                    (10U)
#define CSL_EPWM_AQCTLB_CBD_MASK                                                     (0x00000c00U)
#define CSL_EPWM_AQCTLB_CBD_CLEAR                                                    (1U)
#define CSL_EPWM_AQCTLB_CBD_DISABLED                                                 (0U)
#define CSL_EPWM_AQCTLB_CBD_TOGGLE                                                   (3U)
#define CSL_EPWM_AQCTLB_CBD_SET                                                      (2U)
																					
#define CSL_EPWM_TBCTL_CTRMODE_SHIFT                                                 (0U)
#define CSL_EPWM_TBCTL_CTRMODE_MASK                                                  (0x00000003U)
#define CSL_EPWM_TBCTL_CTRMODE_STOP_FREEZE                                           (3U)
#define CSL_EPWM_TBCTL_CTRMODE_DOWN_COUNT                                            (1U)
#define CSL_EPWM_TBCTL_CTRMODE_UP_COUNT                                              (0U)
#define CSL_EPWM_TBCTL_CTRMODE_UP_DOWN_COUNT                                         (2U)
																					
#define CSL_EPWM_TBCTL_PHSEN_SHIFT                                                   (2U)
#define CSL_EPWM_TBCTL_PHSEN_MASK                                                    (0x00000004U)
#define CSL_EPWM_TBCTL_PHSEN_DO_NOT_LOAD                                             (0U)
#define CSL_EPWM_TBCTL_PHSEN_LOAD                                                    (1U)
																					
#define CSL_EPWM_TBCTL_PRDLD_SHIFT                                                   (3U)
#define CSL_EPWM_TBCTL_PRDLD_MASK                                                    (0x00000008U)
#define CSL_EPWM_TBCTL_PRDLD_LOAD_IMMEDIATELY                                         (1U)
#define CSL_EPWM_TBCTL_PRDLD_LOAD_FROM_SHADOW                                         (0U)
																					
#define CSL_EPWM_TBCTL_SYNCOSEL_SHIFT                                                (4U)
#define CSL_EPWM_TBCTL_SYNCOSEL_MASK                                                 (0x00000030U)
#define CSL_EPWM_TBCTL_SYNCOSEL_CTR_0                                                (1U)
#define CSL_EPWM_TBCTL_SYNCOSEL_CTR_CPMB                                             (2U)
#define CSL_EPWM_TBCTL_SYNCOSEL_EPWMXSYNC                                            (0U)
#define CSL_EPWM_TBCTL_SYNCOSEL_DISABLE_EPWMXSYNCO                                   (3U)
																					
#define CSL_EPWM_TBCTL_SWFSYNC_SHIFT                                                 (6U)
#define CSL_EPWM_TBCTL_SWFSYNC_MASK                                                  (0x00000040U)
#define CSL_EPWM_TBCTL_SWFSYNC_FORCE_SYNC                                            (1U)
#define CSL_EPWM_TBCTL_SWFSYNC_NO_EFFECT                                             (0U)
																					
#define CSL_EPWM_TBCTL_HSPCLKDIV_SHIFT                                               (7U)
#define CSL_EPWM_TBCTL_HSPCLKDIV_MASK                                                (0x00000380U)
#define CSL_EPWM_TBCTL_HSPCLKDIV_DIV_8                                               (4U)
#define CSL_EPWM_TBCTL_HSPCLKDIV_DIV_10                                              (5U)
#define CSL_EPWM_TBCTL_HSPCLKDIV_DIV_2                                               (1U)
#define CSL_EPWM_TBCTL_HSPCLKDIV_DIV_1                                               (0U)
#define CSL_EPWM_TBCTL_HSPCLKDIV_DIV_4                                               (2U)
#define CSL_EPWM_TBCTL_HSPCLKDIV_DIV_6                                               (3U)
#define CSL_EPWM_TBCTL_HSPCLKDIV_DIV_12                                              (6U)
#define CSL_EPWM_TBCTL_HSPCLKDIV_DIV_14                                              (7U)
																					
#define CSL_EPWM_TBCTL_CLKDIV_SHIFT                                                  (10U)
#define CSL_EPWM_TBCTL_CLKDIV_MASK                                                   (0x00001c00U)
#define CSL_EPWM_TBCTL_CLKDIV_DIV_2                                                  (1U)
#define CSL_EPWM_TBCTL_CLKDIV_DIV_8                                                  (3U)
#define CSL_EPWM_TBCTL_CLKDIV_DIV_32                                                 (5U)
#define CSL_EPWM_TBCTL_CLKDIV_DIV_64                                                 (6U)
#define CSL_EPWM_TBCTL_CLKDIV_DIV_16                                                 (4U)
#define CSL_EPWM_TBCTL_CLKDIV_DIV_4                                                  (2U)
#define CSL_EPWM_TBCTL_CLKDIV_DIV_1                                                  (0U)
#define CSL_EPWM_TBCTL_CLKDIV_DIV_128                                                (7U)
																					
#define CSL_EPWM_TBCTL_PHSDIR_SHIFT                                                  (13U)                                                                                                                                                                         
#define CSL_EPWM_TBCTL_PHSDIR_MASK                                                   (0x00002000U)
#define CSL_EPWM_TBCTL_PHSDIR_COUNT_DOWN                                              (0U)                                                                                                                                                                   
#define CSL_EPWM_TBCTL_PHSDIR_COUNT_UP                                                (1U)
																					
