TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define CSL_EPWM_TBCTL_FREE_SOFT_SHIFT                                               (14U)
#define CSL_EPWM_TBCTL_FREE_SOFT_MASK                                                (0x0000c000U)
#define CSL_EPWM_TBCTL_FREE_SOFT_RUN3                                                (3U)
#define CSL_EPWM_TBCTL_FREE_SOFT_STOP_AFTER_NEXT_CTR                                 (0U)                                                                                                                                                                     
#define CSL_EPWM_TBCTL_FREE_SOFT_RUN2                                                (2U)
#define CSL_EPWM_TBCTL_FREE_SOFT_STOP_AFTER_CYCLE                                    (1U)
																					
#define CSL_EPWM_TZFRC_CBC_SHIFT                                                     (1U)
#define CSL_EPWM_TZFRC_CBC_MASK                                                      (0x00000002U)
#define CSL_EPWM_TZFRC_CBC_FORCE_TRIP                                                 (1U)                                                                                                                                                                      
#define CSL_EPWM_TZFRC_CBC_IGNORE                                                     (0U)
																					
#define CSL_EPWM_TZFRC_OST_SHIFT                                                     (2U)
#define CSL_EPWM_TZFRC_OST_MASK                                                      (0x00000004U)                                                                                                                                                                       
#define CSL_EPWM_TZFRC_OST_FORCE_TRIP                                                 (1U)                                                                                                                                                                   
#define CSL_EPWM_TZFRC_OST_IGNORE                                                     (0U)
																					
#define CSL_EPWM_TZCTL_TZA_SHIFT                                                     (0U)
#define CSL_EPWM_TZCTL_TZA_MASK                                                      (0x00000003U)
#define CSL_EPWM_TZCTL_TZA_LOW_STATE                                                 (2U)
#define CSL_EPWM_TZCTL_TZA_HIGH_IMPEDANCE                                            (0U)
#define CSL_EPWM_TZCTL_TZA_HIGH_STATE                                                (1U)
#define CSL_EPWM_TZCTL_TZA_DO_NOTHING                                                (3U)
																					
#define CSL_EPWM_TZCTL_TZB_SHIFT                                                     (2U)
#define CSL_EPWM_TZCTL_TZB_MASK                                                      (0x0000000cU)
#define CSL_EPWM_TZCTL_TZB_LOW_STATE                                                 (2U)
#define CSL_EPWM_TZCTL_TZB_DO_NOTHING                                                (3U)
#define CSL_EPWM_TZCTL_TZB_HIGH_IMPEDANCE                                             (0U)
#define CSL_EPWM_TZCTL_TZB_HIGH_STATE                                                 (1U)
																					
#define CSL_EPWM_TBSTS_CTRDIR_SHIFT                                                  (0U)
#define CSL_EPWM_TBSTS_CTRDIR_MASK                                                   (0x00000001U)
#define CSL_EPWM_TBSTS_CTRDIR_COUNTING_DOWN                                          (0U)
#define CSL_EPWM_TBSTS_CTRDIR_COUNTING_UP                                            (1U)
																					
#define CSL_EPWM_TBSTS_SYNCI_SHIFT                                                   (1U)
#define CSL_EPWM_TBSTS_SYNCI_MASK                                                    (0x00000002U)
#define CSL_EPWM_TBSTS_SYNCI_EXTERNAL_SYNC                                           (1U)
#define CSL_EPWM_TBSTS_SYNCI_NO_EFFECT                                               (0U)
																					
#define CSL_EPWM_TBSTS_CTRMAX_SHIFT                                                  (2U)
#define CSL_EPWM_TBSTS_CTRMAX_MASK                                                   (0x00000004U)
#define CSL_EPWM_TBSTS_CTRMAX_MAX_VALUE_REACHED                                      (1U)
#define CSL_EPWM_TBSTS_CTRMAX_MAX_VALUE_NOT_REACHED                                  (0U)
																					
#define CSL_EPWM_ETFRC_INT_SHIFT                                                     (0U)
#define CSL_EPWM_ETFRC_INT_MASK                                                      (0x00000001U)
#define CSL_EPWM_ETFRC_INT_IGNORED                                                    (0U)
#define CSL_EPWM_ETFRC_INT_GENERATE_INTR                                              (1U)
																					
#define CSL_EPWM_TBPHS_SHIFT                                                         (0U)                                                                                                                                                                   
#define CSL_EPWM_TBPHS_MASK                                                          (0x0000ffffU)
																					
#define CSL_EPWM_TZSEL_CBCN_SHIFT                                                    (0U)
#define CSL_EPWM_TZSEL_CBCN_MASK                                                     (0x000000ffU)
#define CSL_EPWM_TZSEL_CBCN_ENABLE                                                   (1U)
#define CSL_EPWM_TZSEL_CBCN_DISABLE                                                  (0U)
																					
#define CSL_EPWM_TZSEL_OSHTN_SHIFT                                                   (8U)
#define CSL_EPWM_TZSEL_OSHTN_MASK                                                    (0x0000ff00U)
#define CSL_EPWM_TZSEL_OSHTN_ENABLE                                                  (1U)
#define CSL_EPWM_TZSEL_OSHTN_DISABLE                                                 (0U)
																					
#define CSL_EPWM_ETFLG_INT_SHIFT                                                     (0U)                                                                                                                                                                          
#define CSL_EPWM_ETFLG_INT_MASK                                                      (0x00000001U)
#define CSL_EPWM_ETFLG_INT_INTR_GENERATED                                            (1U)                                                                                                                                                       
#define CSL_EPWM_ETFLG_INT_NO_EVT                                                    (0U)
																					
#define CSL_EPWM_DBCTL_OUT_MODE_SHIFT                                                (0U)
#define CSL_EPWM_DBCTL_OUT_MODE_MASK                                                 (0x00000003U)
#define CSL_EPWM_DBCTL_OUT_MODE_ENABLED                                              (3U)
#define CSL_EPWM_DBCTL_OUT_MODE_DISABLED                                             (0U)
#define CSL_EPWM_DBCTL_OUT_MODE_DISABLE_FALLING_EDGE                                 (2U)
#define CSL_EPWM_DBCTL_OUT_MODE_DISABLE_RISING_EDGE                                  (1U)
																					
#define CSL_EPWM_DBCTL_POLSEL_SHIFT                                                  (2U)
#define CSL_EPWM_DBCTL_POLSEL_MASK                                                   (0x0000000cU)
#define CSL_EPWM_DBCTL_POLSEL_ACTIVE_HIGH_COMPLEMENTARY                              (2U)
#define CSL_EPWM_DBCTL_POLSEL_ACTIVE_LOW                                             (3U)
#define CSL_EPWM_DBCTL_POLSEL_ACTIVE_HIGH                                            (0U)
#define CSL_EPWM_DBCTL_POLSEL_ACTIVE_LOW_COMPLEMENTARY                               (1U)
																					
#define CSL_EPWM_DBCTL_IN_MODE_SHIFT                                                 (4U)
#define CSL_EPWM_DBCTL_IN_MODE_MASK                                                  (0x00000030U)
#define CSL_EPWM_DBCTL_IN_MODE_SRC_ARED_AFED                                         (0U)
#define CSL_EPWM_DBCTL_IN_MODE_SRC_ARED_BFED                                         (2U)
#define CSL_EPWM_DBCTL_IN_MODE_SRC_BRED_AFED                                         (1U)
#define CSL_EPWM_DBCTL_IN_MODE_SRC_BRED_BFED                                         (3U)
																					
