TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define CSL_EPWM_TZFLG_INT_SHIFT                                                     (0U)
#define CSL_EPWM_TZFLG_INT_MASK                                                      (0x00000001U)
#define CSL_EPWM_TZFLG_INT_GENERATED                                                 (1U)
#define CSL_EPWM_TZFLG_INT_NOT_GENERATED                                             (0U)
																					
#define CSL_EPWM_TZFLG_CBC_SHIFT                                                     (1U)
#define CSL_EPWM_TZFLG_CBC_MASK                                                      (0x00000002U)
#define CSL_EPWM_TZFLG_CBC_NO_TRIP                                                   (0U)
#define CSL_EPWM_TZFLG_CBC_TRIP                                                      (1U)
																					
#define CSL_EPWM_TZFLG_OST_SHIFT                                                     (2U)
#define CSL_EPWM_TZFLG_OST_MASK                                                      (0x00000004U)
#define CSL_EPWM_TZFLG_OST_NO_TRIP                                                   (0U)
#define CSL_EPWM_TZFLG_OST_TRIP                                                      (1U)
																					
#define CSL_EPWM_TBPRD_SHIFT                                                         (0U)                                                                                                                                                                         
#define CSL_EPWM_TBPRD_MASK                                                          (0x0000ffffU)
#define CSL_EPWM_CMPB_SHIFT                                                          (0U)                                                                                                                                                                            
#define CSL_EPWM_CMPB_MASK                                                           (0x0000ffffU)
																					
#define CSL_EPWM_TZCLR_INT_SHIFT                                                     (0U)
#define CSL_EPWM_TZCLR_INT_MASK                                                      (0x00000001U)
#define CSL_EPWM_TZCLR_INT_CLEAR                                                     (1U)
#define CSL_EPWM_TZCLR_INT_NO_EFFECT                                                 (0U)
																					
#define CSL_EPWM_TZCLR_CBC_SHIFT                                                     (1U)
#define CSL_EPWM_TZCLR_CBC_MASK                                                      (0x00000002U)
#define CSL_EPWM_TZCLR_CBC_NO_EFFECT                                                 (0U)
#define CSL_EPWM_TZCLR_CBC_CLEAR                                                     (1U)
																					
#define CSL_EPWM_TZCLR_OST_SHIFT                                                     (2U)
#define CSL_EPWM_TZCLR_OST_MASK                                                      (0x00000004U)
#define CSL_EPWM_TZCLR_OST_NO_EFFECT                                                 (0U)
#define CSL_EPWM_TZCLR_OST_CLEAR                                                     (1U)
																					
#define CSL_EPWM_DCTRIPSEL_DCAHCOMPSEL_MASK                             			 (0x0000000FU)
#define CSL_EPWM_DCTRIPSEL_DCAHCOMPSEL_SHIFT                            			 (0x00U)
																					
#define CSL_EPWM_DCTRIPSEL_DCALCOMPSEL_MASK                            				 (0x000000F0U)
#define CSL_EPWM_DCTRIPSEL_DCALCOMPSEL_SHIFT                           				 (0x04U)
																					
#define CSL_EPWM_DCTRIPSEL_DCBHCOMPSEL_MASK                            				 (0x00000F00U)
#define CSL_EPWM_DCTRIPSEL_DCBHCOMPSEL_SHIFT                           				 (0x08U)
																					
#define CSL_EPWM_DCTRIPSEL_DCBLCOMPSEL_MASK                            				 (0x0000F000U)
#define CSL_EPWM_DCTRIPSEL_DCBLCOMPSEL_SHIFT                           				 (0x0CU)
																					
#define CSL_EPWM_DCACTL_EVT1SRCSEL_MASK                             				 (0x00000001U)
#define CSL_EPWM_DCACTL_EVT1SRCSEL_SHIFT                             				 (0x00U)
																					
#define CSL_EPWM_DCACTL_EVT1FRC_SYNCSEL_MASK                             			 (0x00000002U)
#define CSL_EPWM_DCACTL_EVT1FRC_SYNCSEL_SHIFT                             			 (0x01U)
																					
																					
#define CSL_EPWM_DCACTL_EVT1SOCE_MASK                             					 (0x00000004U)
#define CSL_EPWM_DCACTL_EVT1SOCE_SHIFT                           					 (0x02U)
																					
#define CSL_EPWM_DCACTL_EVT1SYNCE_MASK                           					 (0x00000008U)
#define CSL_EPWM_DCACTL_EVT1SYNCE_SHIFT                             				 (0x03U)
																					
#define CSL_EPWM_DCACTL_RESERVED_1_MASK                             				(0x000000F0U)
#define CSL_EPWM_DCACTL_RESERVED_1_SHIFT                             				(0x04U)
																					
#define CSL_EPWM_DCACTL_EVT2SRCSEL_MASK                             				(0x00000100U)
#define CSL_EPWM_DCACTL_EVT2SRCSEL_SHIFT                             				(0x08U)
																					
																					
#define CSL_EPWM_DCACTL_EVT2FRC_SYNCSEL_MASK                             			(0x00000200U)
#define CSL_EPWM_DCACTL_EVT2FRC_SYNCSEL_SHIFT                             			(0x09U)
																					
#define CSL_EPWM_DCACTL_RESERVED_2_MASK                             				(0x0000FC00U)
#define CSL_EPWM_DCACTL_RESERVED_2_SHIFT                             				(0x0AU)
																					
																					
#define CSL_EPWM_DCFCTL_SRCSEL_MASK                             					(0x00000003U)
#define CSL_EPWM_DCFCTL_SRCSEL_SHIFT                        	  					(0x00U)
																					
																					
#define CSL_EPWM_DCFCTL_BLANKE_MASK                             					(0x00000004U)
#define CSL_EPWM_DCFCTL_BLANKE_SHIFT                        	    				(0x02U)
																					
#define CSL_EPWM_DCFCTL_BLANKINV_MASK                             					(0x0008U)
#define CSL_EPWM_DCFCTL_BLANKINV_SHIFT                        	  					(0x03U)
																					
																					
#define CSL_EPWM_DCFCTL_PULSESEL_MASK                             					(0x00000030U)
#define CSL_EPWM_DCFCTL_PULSESEL_SHIFT                        	    				(0x04U)
																					
																					
#define CSL_EPWM_DCFCTL_RESERVED_1_MASK                             				(0x00000040U)
#define CSL_EPWM_DCFCTL_RESERVED_1_SHIFT                        	  				(0x06U)
																					
