TexasInstruments/mcal_am263x/mcal/include/hw/am263px/hw_epwm_reg.h
#define CSL_EPWM_DCFCTL_RESERVED_2_MASK                             				(0x00000080U)
#define CSL_EPWM_DCFCTL_RESERVED_2_SHIFT                        	    			(0x07U)
																					
#define CSL_EPWM_DCFCTL_RESERVED_3_MASK                             				(0x00001F00U)
#define CSL_EPWM_DCFCTL_RESERVED_3_SHIFT                        	  				(0x08U)
																					
#define CSL_EPWM_DCFCTL_RESERVED_4_MASK                             				(0x0000E000U)
#define CSL_EPWM_DCFCTL_RESERVED_4_SHIFT                        	    			(0x0DU)
																					
																					
#define CSL_EPWM_DCCAPCTL_CAPE_MASK                      	    					(0x0000001U)
#define CSL_EPWM_DCCAPCTL_CAPE_SHIFT                    		 					(0x00U)
																					
																					
#define CSL_EPWM_DCCAPCTL_SHDWMODE_MASK                      	    				(0x0000002U)
#define CSL_EPWM_DCCAPCTL_SHDWMODE_SHIFT                    		 				(0x01U)
																					
																					
#define CSL_EPWM_DCCAPCTL_RESERVED_1_MASK                      	       				(0x000FFFCU)
#define CSL_EPWM_DCCAPCTL_RESERVED_1_SHIFT                    		 				(0x02U)
																					
#define CSL_EPWM_DCFWINDOW_MASK                      	   							(0x00000FFU)
#define CSL_EPWM_DCFWINDOW_SHIFT                    								(0x00U)
																					
																					
#define CSL_EPWM_DCFWINDOW_RESERVED_MASK                      	   					(0x000FF00U)
#define CSL_EPWM_DCFWINDOW_RESERVED_SHIFT                    						(0x08U)
																					
#define CSL_EPWM_DCFOFFSETCNT_MASK                      							(0x000FFFFU)
#define CSL_EPWM_DCFOFFSETCNT_SHIFT                    								(0x00U)
																					
																					
#define CSL_EPWM_DCCAP_MASK                     		 							(0x000FFFFU)
#define CSL_EPWM_DCCAP_SHIFT                   										(0x00U)
																					
#define CSL_EPWM_DCFWINDOWCNT_MASK                     								(0x00000FFU)
#define CSL_EPWM_DCFWINDOWCNT_SHIFT                   								(0x00U)
																					
																					
#define CSL_EPWM_DCFWINDOWCNT_RESERVED_MASK                     					(0x000FF00U)
#define CSL_EPWM_DCFWINDOWCNT_RESERVED_SHIFT                   						(0x08U)


#ifdef __cplusplus
}
#endif
#endif
